<template>
  <v-row justify="center">
    <v-dialog v-model="AboutAppDialog"   max-width="600px" eager @click:outside="setFalse">
      <v-card style="background-color: white;height: 600px">
        <v-icon style="margin: 10px" color="red" @click="setFalse">mdi-close</v-icon>
        <div id="" style="width: 100%;height: 100%;font-family: IranSans;padding: 20px;overflow: scroll">
          <p>امروزه صنعت گردشکری و توریسم یکی از مهمترین راهکارهای ایجاد ارزش افزوده و بهره وری بیشتر در كشورها محسوب می شود. یکی از نیازهای صنعت گردشگری و توریسم مجتمع های خدماتی رفاهی بین راهی می باشند كه سازمان راهداري و حمل نقل جاده اي بطور مستقيم متولي آن است. ما در اين سازمان تلاش كرده ايم ابتدا شرايط سرمایه گذاری مناسب براي بخش خصوصي را فراهم نماييم و سپس قصد داريم بر كيفيت خدمات آنها نظارت نموده و بستر بهبود كيفي آنها را از طريق جمع آوري نظرات مردمي فراهم آوريم. ايده ايجاد اين نرم افزار نيز در راستاي تسهيل دسترسي به موقعيت مجتمعهاي خدمات رفاهي داراي مجوز و معرفي امكانات وخدمات آنها به مردم و گردشگران و نهايتا جمع آوري نظرات مردمي شكل گرفته است. امیدواريم اين نرم افزار و اطلاعات آن مفید باشد و زمينه استفاده گسترده تر از مجتمعهاي داراي مجوز و بهبود كيفيت خدمات آنها را فراهم آورد.<br>خواهشمنديم اشكالات احتمالي در اين نرم افزار و همچنين اطلاعات مندرج درآن را از طريق ايميل زير يا شماره تماس 84491400 با ما درميان بگذاريد تا زمينه توسعه و بهبود مستمر آن فراهم گردد.\<br>nنشانی: بلوارکشاورز، خیابان فلسطین، خیابان دمشق، شماره 17<br>تلفن دفتر روابط عمومی: 88898397 , 88898400 <br> پست الکترونیک: info@rmto.ir</p>
        </div>

      </v-card>
    </v-dialog>
  </v-row>
</template>

<script>
export default {
  name: "AboutAppDialog",
  props:{
    AboutAppDialog:false
  },
  data: () => ({
    AboutAppDialog:false
  }),
  methods:{
    setFalse(){
      this.$emit("setFalse",false);
    }
  }
}
</script>

<style scoped>
p{
  text-align: right;
}
</style>
