<template>
  <v-bottom-sheet v-model="Layersheet" eager>

    <v-sheet class="text-center" height="800px" :key="$route.fullPath" style="background-color: white;">
      <div style="width: 100%;margin-top: 20px !important;position: fixed;">
        <v-btn id="btnBetween" class="btn" @click="setPlaceString('between')"><v-icon>mdi-map-marker-distance</v-icon>{{$t('SearchSheet.Between')}}</v-btn>
        <v-btn id="btnOtherPlace" class="btn" @click="setPlaceString('otherplace')"><v-icon>mdi-map-marker</v-icon>{{$t('SearchSheet.Near')}}</v-btn>
        <v-btn id="btnMyLocation" class="btn" @click="setPlaceString('myLocation')"><v-icon>mdi-map-marker-radius</v-icon>{{$t('SearchSheet.NearMe')}}</v-btn>
      </div>

      <v-row justify="center">
        <v-dialog v-model="SelectFromMapDialog"  max-width="500px" eager @click:outside="UnsubscribeToAddDialog=true">
          <v-card style="background-color: white;height: 500px">
            <div id="SelectFromMapDiv" style="width: 100%;height: 90%;">

            </div>
            <v-card-actions
                style="background-color: purple;height: 50px;position: relative;bottom: 0;right: 0;width: 100%;">
              <v-spacer></v-spacer>
              <p style="color: white;margin: 70px">انتخاب مکان مورد نظر</p>
            </v-card-actions>
          </v-card>
        </v-dialog>
      </v-row>

      <div id="myLocationSearch" style="font-size: 15px">
        <p class="SearchRadius" style="font-family: IranSans;margin-top: 30px;direction: rtl;float: right;margin-right: 30px;">{{$t('SearchSheet.SearchRadius')}}</p>
        <input v-model="myLocValue" min="0" max="500" id="when_change_range" type="range"><br><br>
        <input type="text" id="text_for_show_range">
      </div>
      <div id="otherPlaceSearch" style="font-size: 15px">
        <v-combobox id="txtCity" class="textField" v-model="otherlatlng"  :items="cities" item-value="latlng" item-text="name" append-icon="" editable solo dense return-object v-bind:label="$t('SearchSheet.EnterCityName')" style="width: 40%;position: absolute;right: 30px;font-family: IranSans;font-size: small;top:18px" :reverse="isReverse"></v-combobox>
        <v-btn style="float: left;margin-left: 20px;margin-top: 20px;font-size:12px;font-family: IranSans" @click="SelectFromMapDialog=true;setMapForAddArea('otherplace')">{{$t('SearchSheet.ChooseOnMap')}}</v-btn>
        <p class="SearchRadius" style="font-family: IranSans;display: flex;justify-content: right;top: 85px;direction: rtl;position: absolute;right: 30px;margin-left: 30px">{{$t('SearchSheet.SearchRadius')}}</p>
        <input v-model="otherPlaceValue" min="0" max="500" id="when_change_range1" type="range">
        <input type="text" id="text_for_show_range1">
      </div>
      <div id="betweenSearch" style="font-size: 10px">
        <v-combobox append-icon="" solo id="txtCity" class="textField" v-model="firstlatlng"  :items="cities" item-value="latlng" item-text="name" editable dense v-bind:label="$t('SearchSheet.EnterFirstCityName')" style="width: 40%;position: absolute;right: 30px;top: 18px;font-size: xx-small" :reverse="isReverse"></v-combobox>
        <v-btn style="float: left;margin-left: 20px;margin-top: 20px;font-size:12px" @click="SelectFromMapDialog=true;setMapForAddArea('firstlatlng')">{{$t('SearchSheet.ChooseOnMap')}}</v-btn>
        <v-combobox append-icon="" solo id="txtCity" class="textField" v-model="secondlatlng"  :items="cities" item-value="latlng" item-text="name" editable dense v-bind:label="$t('SearchSheet.EnterSecondCityName')" style="width: 40%;position: absolute;right: 30px;top:68px;font-size: xx-small" :reverse="isReverse"></v-combobox>
        <v-btn style="float: left;margin-left: 20px;margin-top: 20px;font-size:12px;position: absolute;top: 50px;left: 0px" @click="SelectFromMapDialog=true;setMapForAddArea('secondlatlng')">{{$t('SearchSheet.ChooseOnMap')}}</v-btn>
      </div>

      <p style="position: relative;text-align: center;top: 29% !important;color: #7fbeb5;font-family: IranSans">{{$t('SearchSheet.SelectServices')}}</p>
      <div  style="height: 40%;width: 100%;position: absolute;bottom: 150px;overflow: scroll;padding-top: 30px;padding-left: 10px">
        <v-card v-for="i in serviceTypes" style="width:70px;height: 100px;display:inline-block;margin-top: 10px;margin-right: 20px;position: relative" :color="i.color" @click="changeTypeDivColor(i.midwayServiceAreaTypeId)" :ripple="false">
          <v-img :src="'data:application;base64,'+i.documents[0].base64File" style="width: 50px;display: flex;margin-left: 10px;position: relative;top:0"></v-img>
          <p style="font-size: 10px;display: flex;justify-content: center;margin-top: 20px;bottom: 0;color: black;text-align: center">{{i.name}}</p>
        </v-card>
      </div>
      <v-btn class="btn" style="bottom: -605px;background-color:#2ec4b4;color:white !important " @click="LoadMarkers();">{{$t('SearchSheet.Search')}}</v-btn>
    </v-sheet>
    <ServiceAreaDetailsDialog  :ServiceAreaDetailsDialog="ServiceAreaDetailsDialog" :slideArray="slideArray" :detail="detail" :saveColor="saveColor" :services="services" :ratingArray="ratingArray"/>
    <v-snackbar  v-model="snackbar" :timeout="3000" :color="snackColor"  rounded="pill" style="text-align: center;margin: auto;min-width: 0 !important;width: 20px;font-family: IranSans;">
      <v-icon style="float:right;">{{ snackIcon }}</v-icon>
      {{ snackText }}
    </v-snackbar>
  </v-bottom-sheet>
</template>

<script>
import inStreetStyle   from '../fa_map/mapbox-street.json';
import ServiceAreaDetailsDialog from './ServiceAreaDetailsDialog.vue'
import { mdiMapMarkerRadius } from '@mdi/js';
import VueSlideBar from 'vue-slide-bar';
import axios from "axios";
import $ from "jquery";
import mapboxgl from "mapbox-gl";
import MapboxLanguage from '@mapbox/mapbox-gl-language';
import * as turf from "@turf/turf";
export default {
  name: "SearchSheet",
  props: {
    ServiceAreaDetailsDialog:false,
    Layersheet: false,
    lat: "",
    lng: "",
    services : [],
    slideArray : [],
    ratingArray:[],
    detail:{},
    saveColor:"",
    typeDivColor:"white"
  },
  data: () => ({
    myLocValue: 0,
    otherPlaceValue: 0,
    SelectFromMapDialog: null,
    mylocation: mdiMapMarkerRadius,
    serviceTypes: [],
    areaNames:[],
    selectedTypes:[],
    urlResponse:[],
    favoriteAreas:[],
    cities:[
      {name:"آواجیق",latlng:"44.1570220700251 39.3319110170607"},
      {name:"سیه چشمه",latlng:"44.3844780702256 39.0682472449416"},
      {name:"بازرگان",latlng:"44.3874320339496 39.3921658902917"},
      {name:"قطور",latlng:"44.4076014258033 38.4716484270218"},
      {name:"ماکو",latlng:"44.5073265069752 39.2883211992492"},
      {name:"زرآباد",latlng:"59.4064618634072 25.5964504045021"},
      {name:"سرو",latlng:"44.6560326018023 37.721573965666"},
      {name:"تازه شهر",latlng:"44.6894126100733 38.1722391884877"},
      {name:"شوط",latlng:"44.7690643114568 39.2178525665504"},
      {name:"سلماس",latlng:"44.769786157431 38.1973245830229"},
      {name:"فیرورق",latlng:"44.8309453450674 38.582670844127"},
      {name:"سیلوانه",latlng:"44.8539638379378 37.4214771556002"},
      {name:"خوی",latlng:"44.9401826967317 38.5462925724782"},
      {name:"مرگنلر",latlng:"44.9493931810432 39.1473459270106"},
      {name:"دیزج دیز",latlng:"45.0238549260397 38.4595527244877"},
      {name:"قره ضیاڈالدین",latlng:"45.0256203646482 38.8857719231224"},
      {name:"قوشچی",latlng:"45.0413067298553 37.9889025009168"},
      {name:"نوشین",latlng:"45.0521666126441 37.7350840561279"},
      {name:"نازک علیا",latlng:"45.0588473195205 39.0101988876585"},
      {name:"شهر ارومیه",latlng:"45.0614191220555 37.5458759320211"},
      {name:"پلدشت",latlng:"45.0679399586281 39.3484956079915"},
      {name:"اشنویه",latlng:"45.098845990718 37.0398387104515"},
      {name:"پیرانشهر",latlng:"45.1412720655604 36.6968365223532"},
      {name:"نالوس",latlng:"45.1433372293284 36.9841062471697"},
      {name:"ایواوغلی",latlng:"45.2076810408103 38.7138645763423"},
      {name:"گردکشانه",latlng:"45.2613899846718 36.8110643270027"},
      {name:"تسوج",latlng:"45.3645447780079 38.3113476333678"},
      {name:"میرآباد",latlng:"45.3722324552825 36.4061440927322"},
      {name:"نقده",latlng:"45.3883376014542 36.9528665260765"},
      {name:"سردشت",latlng:"57.9051223140009 26.4565340725692"},
      {name:"شرفخانه",latlng:"45.4899247464146 38.1815458791138"},
      {name:"محمدیار",latlng:"45.5186586327219 36.9831710970093"},
      {name:"ربط",latlng:"45.5511583646778 36.2099094699201"},
      {name:"کشکسرای",latlng:"45.5649659722933 38.4572060300378"},
      {name:"کوزه کنان",latlng:"45.5825896306691 38.1898630094536"},
      {name:"قصرشیرین",latlng:"45.586456277596 34.5167063101447"},
      {name:"شندآباد",latlng:"45.6278399058848 38.148842530352"},
      {name:"جلفا",latlng:"45.6280983844251 38.9359966444143"},
      {name:"خامنه",latlng:"45.6309784499883 38.1871469648615"},
      {name:"سومار",latlng:"45.6403584515014 33.8828461367224"},
      {name:"یامچی",latlng:"45.6433491814566 38.5236964798508"},
      {name:"هادیشهر",latlng:"45.6547878974407 38.8380504631155"},
      {name:"شبستر",latlng:"45.6975418556177 38.1706280394349"},
      {name:"وایقان",latlng:"45.6978419655603 38.1192911401847"},
      {name:"مهاباد",latlng:"52.2195692441391 33.5293910254842"},
      {name:"کانی سور",latlng:"45.7488940528523 36.0575287995148"},
      {name:"مرند",latlng:"45.762580774881 38.4473064903208"},
      {name:"زنوز",latlng:"45.7836524145796 38.5663675292753"},
      {name:"آرمرده",latlng:"45.7946620388163 35.9309342343444"},
      {name:"خلیفان",latlng:"45.7970126231694 36.5073508074524"},
      {name:"سیس",latlng:"45.82011803873 38.196483504009"},
      {name:"ازگله",latlng:"45.8422071487759 34.8327698838125"},
      {name:"سرپل ذهاب",latlng:"45.8626780556394 34.4580399354124"},
      {name:"بانه",latlng:"45.882724311715 35.9859348604247"},
      {name:"عجب شیر",latlng:"45.8862446512486 37.4891400879007"},
      {name:"بناب جدید",latlng:"45.9003161981562 38.4255311553895"},
      {name:"گوگان",latlng:"45.9054788425454 37.7800776712708"},
      {name:"گیلانغرب",latlng:"45.9195910225628 34.1413676458989"},
      {name:"بویین سفلی",latlng:"45.9349793968674 35.9370487801182"},
      {name:"ممقان",latlng:"45.9542804648338 37.8436967307206"},
      {name:"آذرشهر",latlng:"45.9732410350825 37.7643070618282"},
      {name:"چهاربرج",latlng:"45.9745884951185 37.1233781161582"},
      {name:"صوفیان",latlng:"45.9776641354142 38.2666970610642"},
      {name:"ایلخچی",latlng:"45.9782432628717 37.9373702628861"},
      {name:"سیه رود",latlng:"46.0023188746001 38.8654398699815"},
      {name:"خسروشهر",latlng:"46.0420519126302 37.956381808704"},
      {name:"بناب",latlng:"46.0546423729717 37.3425700306988"},
      {name:"ملکان",latlng:"46.0984019758671 37.1520747582012"},
      {name:"میاندوآب",latlng:"46.1023799405936 36.9644423992942"},
      {name:"اسکو",latlng:"46.125680235917 37.914230745744"},
      {name:"سهند",latlng:"46.1342023257183 37.9433762823288"},
      {name:"سردرود",latlng:"46.1412850688893 38.0302024909455"},
      {name:"تازه آباد",latlng:"46.1520502928594 34.7373167717757"},
      {name:"سیمینه",latlng:"46.1536377915397 36.7300220492385"},
      {name:"مریوان",latlng:"46.168838975271 35.5185183181337"},
      {name:"مهران",latlng:"46.1722882329246 33.1204572742862"},
      {name:"خاروانا",latlng:"46.1764712032635 38.6911563937241"},
      {name:"زرنه",latlng:"46.1864896574072 33.926446339468"},
      {name:"صالح آباد",latlng:"61.0901313691512 35.6881376457758"},
      {name:"لیلان",latlng:"46.2014288320516 37.0118751168193"},
      {name:"نوسود",latlng:"46.2034156617935 35.1640139500083"},
      {name:"بوکان",latlng:"46.2087345844481 36.525094525633"},
      {name:"کانی دینار",latlng:"46.2087796358138 35.4667981144736"},
      {name:"کرند",latlng:"46.2375908557788 34.2790397999911"},
      {name:"شهر مراغه",latlng:"46.2512513043625 37.3794332894761"},
      {name:"نودشه",latlng:"46.2539265829947 35.1812274638878"},
      {name:"باینگان",latlng:"46.2709812160107 34.9810445136302"},
      {name:"شهر تبریز",latlng:"46.2763164228538 38.0685854009878"},
      {name:"سقز",latlng:"46.2796956811318 36.2357538007313"},
      {name:"چوار",latlng:"46.2985970102943 33.6957254595076"},
      {name:"چناره",latlng:"46.3043390022862 35.633138238747"},
      {name:"ایوان",latlng:"46.3085769834189 33.8266409783786"},
      {name:"باروق",latlng:"46.3224977745457 36.9526147030208"},
      {name:"سرمست",latlng:"46.3312228138994 34.0278585469473"},
      {name:"کشاورز",latlng:"46.3589637990025 36.8347001370772"},
      {name:"پاوه",latlng:"46.3597641628035 35.0415695826935"},
      {name:"سروآباد",latlng:"46.3689084994337 35.3097480190551"},
      {name:"ایلام",latlng:"46.4053422559226 33.6265721720893"},
      {name:"گهواره",latlng:"46.4175899563795 34.3435240971807"},
      {name:"شاهو",latlng:"46.4603313627761 34.9366000829056"},
      {name:"صاحب",latlng:"46.4614650064692 36.2044778741732"},
      {name:"آسمان آباد",latlng:"46.4632971921997 33.849847647949"},
      {name:"باسمنج",latlng:"46.47343497131 37.9946424504786"},
      {name:"جوانرود",latlng:"46.4944360441807 34.8058352159487"},
      {name:"محمودآباد",latlng:"52.2641160124151 36.6252871718352"},
      {name:"خداجو(خراجو)",latlng:"46.5301468767105 37.3069087550286"},
      {name:"اسلام آبادغرب",latlng:"46.5309084890484 34.1094396221938"},
      {name:"شاهین دژ",latlng:"46.561502176333 36.6792695904938"},
      {name:"سرابله",latlng:"46.5654001215168 33.7669858313509"},
      {name:"خواجه",latlng:"46.5939624261327 38.1556833202653"},
      {name:"دلگشا",latlng:"46.5939732337761 33.4059206082091"},
      {name:"ارکواز",latlng:"46.5957612637991 33.3846662932256"},
      {name:"کوزران",latlng:"46.599988868821 34.495905551928"},
      {name:"ورزقان",latlng:"46.6537728621285 38.5074343681908"},
      {name:"روانسر",latlng:"46.6544346671829 34.7126628467231"},
      {name:"شویشه",latlng:"46.6759824097176 35.3565698750558"},
      {name:"نظرکهریزی",latlng:"46.7631881820103 37.3481431688722"},
      {name:"حمیل",latlng:"46.7737975763417 33.9373791431673"},
      {name:"رباط",latlng:"46.8064461602396 34.2665082336402"},
      {name:"لومار",latlng:"46.8124726389026 33.567294503946"},
      {name:"بستان آباد",latlng:"46.8331358319149 37.8425635307672"},
      {name:"پهله",latlng:"46.8838622097298 33.0107355772378"},
      {name:"میمه",latlng:"51.1730979117254 33.4439366516726"},
      {name:"زرینه",latlng:"46.9183088454495 36.0588306046595"},
      {name:"کامیاران",latlng:"46.9358230956354 34.7988520022094"},
      {name:"بخشایش",latlng:"46.9426916555827 38.1342094514361"},
      {name:"تیکمه داش",latlng:"46.9487251947198 37.7328625945031"},
      {name:"قره آغاج",latlng:"46.971840787873 37.1293598383296"},
      {name:"کلوانق",latlng:"47.0020740951667 38.104007373779"},
      {name:"شهر سنندج",latlng:"47.009569822957 35.3080760672255"},
      {name:"خمارلو",latlng:"47.0263253959918 39.1565506429004"},
      {name:"دیواندره",latlng:"47.0268599139673 35.9131950493476"},
      {name:"بدره",latlng:"47.038329606606 33.3064641504933"},
      {name:"کلیبر",latlng:"47.045700443422 38.8613342219225"},
      {name:"هشترود",latlng:"47.0532483664257 37.4745739420304"},
      {name:"توحید",latlng:"47.0665501631595 33.7258610588982"},
      {name:"اهر",latlng:"47.0703120723287 38.4744913466466"},
      {name:"زرنق",latlng:"47.0739586306846 38.0961360777471"},
      {name:"شهر کرمانشاه",latlng:"47.0896002942316 34.3400875656162"},
      {name:"هلشی",latlng:"47.0915488725073 34.1130015798481"},
      {name:"شربیان",latlng:"47.1024918583273 37.8949627255409"},
      {name:"تکاب",latlng:"47.1141542461433 36.404746502412"},
      {name:"دوزدوزان",latlng:"47.1207822843925 37.9478658932278"},
      {name:"هریس",latlng:"47.1223661326278 38.2528944862621"},
      {name:"مهربان",latlng:"47.1272601673541 38.0744894218633"},
      {name:"درب گنبد",latlng:"47.1474125573761 33.6918018839177"},
      {name:"موچش",latlng:"47.1511890370827 35.0532011750947"},
      {name:"گراب",latlng:"47.2366738539255 33.4747699089214"},
      {name:"آبش احمد",latlng:"47.3173015147323 39.0461321552177"},
      {name:"بلبان آباد",latlng:"47.3198727022671 35.1425384191591"},
      {name:"کونانی",latlng:"47.3295255825198 33.4013565486679"},
      {name:"هوراند",latlng:"47.3637635375591 38.8599944291369"},
      {name:"موسیان",latlng:"47.377287385917 32.5206944964954"},
      {name:"دره شهر",latlng:"47.3816650244612 33.1447781232051"},
      {name:"ترکمانچای",latlng:"47.3910585424337 37.5772970415511"},
      {name:"دهلران",latlng:"47.4064179832693 32.6937471453424"},
      {name:"اصلاندوز",latlng:"47.408789287334 39.4419733546823"},
      {name:"دهگلان",latlng:"47.4153760765884 35.2800234179747"},
      {name:"آبدانان",latlng:"47.4191079303973 32.9942431801417"},
      {name:"بیستون",latlng:"47.4284307962728 34.3819090950483"},
      {name:"میان راهان",latlng:"47.444334372989 34.5837410159058"},
      {name:"سطر",latlng:"47.4617739377926 34.8123688047946"},
      {name:"چقابل",latlng:"47.5098639735288 33.2816540264022"},
      {name:"سراب",latlng:"47.5334975458021 37.9351288698081"},
      {name:"سراب باغ",latlng:"47.5755339788352 32.8979787645069"},
      {name:"هرسین",latlng:"47.5847552750545 34.2731238605754"},
      {name:"بیجار",latlng:"47.6015681038696 35.8699256356842"},
      {name:"سنقر",latlng:"47.6015855051111 34.7742425050035"},
      {name:"کوهدشت",latlng:"47.6034765424652 33.5346012946745"},
      {name:"دندی",latlng:"47.6245622159688 36.5512446859588"},
      {name:"ماه نشان",latlng:"47.6704633304456 36.7459516293957"},
      {name:"مشگین شهر",latlng:"47.6763783903887 38.3961756999005"},
      {name:"مورموری",latlng:"47.677156454577 32.7279198055454"},
      {name:"صحنه",latlng:"47.6878232950982 34.4804867449057"},
      {name:"میانه",latlng:"47.7108258106222 37.4289541117956"},
      {name:"پلدختر",latlng:"47.7160002900624 33.1457051970303"},
      {name:"یاسوکند",latlng:"47.7423792340623 36.2811563983406"},
      {name:"تازه کندانگوت",latlng:"47.7465650467376 39.0406299272709"},
      {name:"مرادلو",latlng:"47.7486669392411 38.7465264086372"},
      {name:"هفت چشمه",latlng:"47.7651506292875 34.2098908155695"},
      {name:"ترک",latlng:"47.7721959120178 37.62115932911"},
      {name:"سریش آباد",latlng:"47.785127350516 35.2571377113054"},
      {name:"بابارشانی",latlng:"47.7978624353832 35.6790488344136"},
      {name:"قروه",latlng:"47.7989221196867 35.1624510760684"},
      {name:"لاهرود",latlng:"47.8292345861501 38.5089645744646"},
      {name:"فخراباد",latlng:"47.8669875033769 38.5236063791808"},
      {name:"رفیع",latlng:"47.8919614635627 31.5969807047425"},
      {name:"پارس آباد",latlng:"47.9068801209132 39.6478781390239"},
      {name:"کنگاور",latlng:"47.9609231448589 34.5041307785956"},
      {name:"معمولان",latlng:"47.9618429338592 33.3780789794355"},
      {name:"دزج",latlng:"47.9689587185688 35.0618426542188"},
      {name:"دلبران",latlng:"47.9853827514503 35.2460594461542"},
      {name:"بستان",latlng:"47.9865653228244 31.7225357933571"},
      {name:"نورآباد",latlng:"51.538876552303 30.1119336016779"},
      {name:"نیر",latlng:"54.1293304312877 31.4860771353519"},
      {name:"تازه کند",latlng:"48.0183892975681 39.5771585132605"},
      {name:"سراب دوره",latlng:"48.0260065063747 33.5613065493479"},
      {name:"ویسیان",latlng:"48.030986452438 33.488359443059"},
      {name:"حلب",latlng:"48.0602779667765 36.297032324942"},
      {name:"آقکند",latlng:"48.0607032263066 37.2585645283518"},
      {name:"سرعین",latlng:"48.0717039834174 38.1464327217254"},
      {name:"هویزه",latlng:"48.0789912666534 31.461223616853"},
      {name:"گرمی",latlng:"48.0808018809343 39.0250544385629"},
      {name:"جعفرآباد",latlng:"48.0935585696145 39.4309135340837"},
      {name:"رضی",latlng:"48.0990230482751 38.6297969628903"},
      {name:"فیروزآباد",latlng:"52.5680849786124 28.8480725646325"},
      {name:"فیروزان",latlng:"48.1084737213898 34.3647525668188"},
      {name:"اسدآباد",latlng:"48.1196286231301 34.7822370402489"},
      {name:"صالح مشطت",latlng:"48.1500751654794 32.3139524817938"},
      {name:"سوسنگرد",latlng:"48.188717290294 31.5554490517315"},
      {name:"خرمشهر",latlng:"48.1898281363564 30.4258723731427"},
      {name:"گرماب",latlng:"48.1983887525096 35.8500141828971"},
      {name:"گل تپه",latlng:"48.2060079982365 35.2204568229588"},
      {name:"مینوشهر",latlng:"48.2220703496078 30.351297604148"},
      {name:"کوراییم",latlng:"48.2361252979618 37.9534743331168"},
      {name:"گیان",latlng:"48.2438726217402 34.1757711531992"},
      {name:"حسینیه",latlng:"48.246583703018 32.6796596252607"},
      {name:"شوش",latlng:"48.2480099920959 32.1945600422483"},
      {name:"الشتر",latlng:"48.2599961312964 33.8634234943805"},
      {name:"برزول",latlng:"48.2616114663675 34.215109559947"},
      {name:"شهر آبادان",latlng:"48.2791165204275 30.348256859237"},
      {name:"فرسفج",latlng:"48.2877099796467 34.4886467787922"},
      {name:"زرین آباد",latlng:"48.2921469560183 36.4232145694656"},
      {name:"شهر اردبیل",latlng:"48.292803512397 38.2502336014615"},
      {name:"شاوور",latlng:"48.3034829578037 32.0505686989604"},
      {name:"هشتجین",latlng:"48.3265388941101 37.3700316438981"},
      {name:"بیله سوار",latlng:"48.342890079044 39.3752901915948"},
      {name:"گیوی",latlng:"48.3429097258239 37.6899922591686"},
      {name:"الوان",latlng:"48.3477288368276 31.8758128687958"},
      {name:"اندیمشک",latlng:"48.3484809994139 32.4458523355933"},
      {name:"شهر خرم آباد",latlng:"48.3519915742388 33.4911137333109"},
      {name:"ارمغانخانه",latlng:"48.3654992006456 36.9736629428476"},
      {name:"نهاوند",latlng:"48.3717011230003 34.1931043356657"},
      {name:"دزفول",latlng:"48.3942681687537 32.4016290890361"},
      {name:"صفی آباد",latlng:"57.9254937672778 36.6953204935124"},
      {name:"دارخوین",latlng:"48.4309109210221 30.7458153985041"},
      {name:"عنبران",latlng:"48.4326946442202 38.4875818129102"},
      {name:"دزآب",latlng:"48.433961867343 32.2194107258936"},
      {name:"بهار",latlng:"48.4355837726386 34.9040717830712"},
      {name:"حمیدیه",latlng:"48.4377739662917 31.4828073858338"},
      {name:"سهرورد",latlng:"48.4387723996078 36.0739207663033"},
      {name:"میانرود",latlng:"48.4432517211533 32.1538387685641"},
      {name:"تویسرکان",latlng:"48.4445030282853 34.5483630778164"},
      {name:"سرکان",latlng:"48.4498210090624 34.6000308681511"},
      {name:"شیرین سو",latlng:"48.4511995223976 35.4917843337164"},
      {name:"مریانج",latlng:"48.4638783411786 34.8367823922529"},
      {name:"لالجین",latlng:"48.4744434159056 34.9749860669414"},
      {name:"زرین رود",latlng:"48.4803124905169 35.7600159974899"},
      {name:"نمین",latlng:"48.4852090850758 38.4236727447737"},
      {name:"حر",latlng:"48.4955198591858 32.0648458724705"},
      {name:"شهر زنجان",latlng:"48.5034780509787 36.6798920740268"},
      {name:"هیر",latlng:"48.5053853178693 38.0772712763639"},
      {name:"اروندکنار",latlng:"48.5248882708524 29.9830925074612"},
      {name:"خلخال",latlng:"48.5282308266257 37.616054280111"},
      {name:"شهر همدان",latlng:"48.5421022139063 34.8448783503201"},
      {name:"سجاس",latlng:"48.5495493955232 36.2411506870689"},
      {name:"چغامیش",latlng:"48.5497644097156 32.2098715806508"},
      {name:"جورقان",latlng:"48.5508577761165 34.8842769460225"},
      {name:"آبی بیگلو",latlng:"48.5528558028392 38.2817993230889"},
      {name:"چغلوندی",latlng:"48.5593945755314 33.6502344457374"},
      {name:"چویبده",latlng:"48.5658233660763 30.195050520266"},
      {name:"حمزه",latlng:"48.5843738260114 32.3968175075324"},
      {name:"قیدار",latlng:"48.5896115594491 36.1216523872874"},
      {name:"اشترینان",latlng:"48.6414853335984 34.0135532044166"},
      {name:"شادگان",latlng:"48.6597392464031 30.6514421637111"},
      {name:"صالح شهر",latlng:"48.6668928050704 32.2174084564019"},
      {name:"شهر اهواز",latlng:"48.6840662738574 31.3089605116479"},
      {name:"جوکار",latlng:"48.6855639995041 34.4307963185939"},
      {name:"سامن",latlng:"48.7041371160469 34.2086312006451"},
      {name:"زاغه",latlng:"48.7054171530423 33.5010863261516"},
      {name:"ازندریان",latlng:"48.7058201229208 34.5004956492406"},
      {name:"کلور",latlng:"48.7204745527687 37.3875259100279"},
      {name:"کبودراهنگ",latlng:"48.7253215312903 35.2093178429425"},
      {name:"گوریه",latlng:"48.7548702832011 31.8544268266512"},
      {name:"شهر بروجرد",latlng:"48.758887804144 33.8975663396956"},
      {name:"سالند",latlng:"48.7592337056082 32.4174278444084"},
      {name:"شرافت",latlng:"48.7667870745104 32.0861727060914"},
      {name:"چورزق",latlng:"48.7780807415936 36.9997009438754"},
      {name:"شیبان",latlng:"48.7947576544859 31.4044984512781"},
      {name:"سلطانیه",latlng:"48.7966125908003 36.4373199909554"},
      {name:"ملایر",latlng:"48.81384412296 34.2991735567158"},
      {name:"جنت مکان",latlng:"48.8177731393707 32.1862073560097"},
      {name:"گتوند",latlng:"48.8180246488424 32.2514536833486"},
      {name:"دمق",latlng:"48.8218719558737 35.4416372462854"},
      {name:"شوشتر",latlng:"48.8450883276755 32.0477059494252"},
      {name:"ترکالکی",latlng:"48.8519323313649 32.2457285617963"},
      {name:"سماله",latlng:"48.8577672835492 32.1998675029818"},
      {name:"آستارا",latlng:"48.861437856193 38.4238436130657"},
      {name:"ویس",latlng:"48.8669423434783 31.4718502079153"},
      {name:"لوندویل",latlng:"48.8678192808982 38.3072381137749"},
      {name:"ملاثانی",latlng:"48.8848165825076 31.5846465671469"},
      {name:"سپیددشت",latlng:"48.8852403707267 33.2196874914125"},
      {name:"چوبر",latlng:"48.8931356448467 38.1801815802329"},
      {name:"حویق",latlng:"48.8989221640724 38.1478921196379"},
      {name:"چالانچولان",latlng:"48.907306859208 33.6655081333797"},
      {name:"لیسار",latlng:"48.9083460336595 37.9588158523264"},
      {name:"تالش",latlng:"48.9089766543992 37.7986692913048"},
      {name:"آب بر",latlng:"48.9598111157634 36.9262408638722"},
      {name:"اسالم",latlng:"48.960345582822 37.7188291299535"},
      {name:"فامنین",latlng:"48.9749024904979 35.1135336019646"},
      {name:"ماسوله",latlng:"48.9893338203042 37.1548980476541"},
      {name:"قهاوند",latlng:"49.0014935640301 34.8612356567648"},
      {name:"زنگنه",latlng:"49.0092995840024 34.1546700016824"},
      {name:"رزن",latlng:"49.0339883962279 35.3922735699261"},
      {name:"بندرامام خمینی",latlng:"49.0519889293404 30.5563263724679"},
      {name:"دورود",latlng:"49.0595366576263 33.4937582993555"},
      {name:"پره سر",latlng:"49.0679532560317 37.6023675884183"},
      {name:"صایین قلعه",latlng:"49.0715816982479 36.308289284555"},
      {name:"لالی",latlng:"49.0953142668555 32.3281132234102"},
      {name:"قروه درجزین",latlng:"49.1009997829874 35.3113997464635"},
      {name:"بازارجمعه",latlng:"49.1198363302114 37.4068265180885"},
      {name:"ماسال",latlng:"49.1310339007014 37.3637500829457"},
      {name:"هیدج",latlng:"49.1318958299273 36.2566904438589"},
      {name:"رضوانشهر",latlng:"51.1073109988815 32.7094555406758"},
      {name:"چمران",latlng:"49.1716680609 30.7094797951714"},
      {name:"بندرماهشهر",latlng:"49.1867386041172 30.5511053283012"},
      {name:"خنداب",latlng:"49.186783227079 34.3931079156127"},
      {name:"شول آباد",latlng:"49.1871013405693 33.1889705655971"},
      {name:"سیردان",latlng:"49.1914836920176 36.6479429134259"},
      {name:"خرمدره",latlng:"49.1966543574638 36.2078761209604"},
      {name:"میلاجرد",latlng:"49.2068613577842 34.6231073613797"},
      {name:"آوج",latlng:"49.2163784238208 35.5703704923993"},
      {name:"ابهر",latlng:"49.2222110365091 36.1519497596061"},
      {name:"گوراب زرمیخ",latlng:"49.223071514068 37.3053422591265"},
      {name:"هندودر",latlng:"49.2316076817429 33.7798504441877"},
      {name:"آبگرم",latlng:"49.2849078712175 35.7570919558085"},
      {name:"توره",latlng:"49.2895650368514 34.0452974359664"},
      {name:"شهر مسجدسلیمان",latlng:"49.2923666155837 31.9638356344958"},
      {name:"فومن",latlng:"49.3131712697024 37.2268376998407"},
      {name:"صومعه سرا",latlng:"49.3179944061192 37.3017459341394"},
      {name:"جاورسیان",latlng:"49.3284855627028 34.2575461145902"},
      {name:"کمیجان",latlng:"49.328851974976 34.7162696206298"},
      {name:"آستانه",latlng:"49.3537617649204 33.8883231065396"},
      {name:"احمدسرگوراب",latlng:"49.3679684714221 37.136639265436"},
      {name:"مرجقل",latlng:"49.3761948009072 37.2768667711665"},
      {name:"رامشیر",latlng:"49.4054682699354 30.8958333005963"},
      {name:"شفت",latlng:"49.405765796104 37.1707619108672"},
      {name:"شازند",latlng:"49.4138193919261 33.9338826939446"},
      {name:"منجیل",latlng:"49.4177497647859 36.7385404229383"},
      {name:"رودبار",latlng:"49.421205428617 36.8142513236401"},
      {name:"مهاجران",latlng:"49.4334313240652 34.0479882444792"},
      {name:"ضیاڈآباد",latlng:"49.4353297040192 36.0369321191066"},
      {name:"مشراگه",latlng:"49.4370077048635 31.0108083018042"},
      {name:"قلعه خواجه",latlng:"49.45359900376 32.2083101478911"},
      {name:"ازنا",latlng:"49.4563144212876 33.4537485492357"},
      {name:"شهر بندرانزلی",latlng:"49.4651166582846 37.4694892087722"},
      {name:"رستم آباد",latlng:"49.4947948437701 36.9002464505745"},
      {name:"ساروق",latlng:"49.5085704491847 34.4081576412946"},
      {name:"لوشان",latlng:"49.5106046397529 36.6338881642614"},
      {name:"خرمدشت",latlng:"49.5115238299022 35.928125628324"},
      {name:"مومن آباد",latlng:"49.5225283133387 33.5906825594218"},
      {name:"هفتگل",latlng:"49.5250954194649 31.4455460399527"},
      {name:"توتکابن",latlng:"49.5290913777823 36.8913636639734"},
      {name:"شهر رشت",latlng:"49.5956532922276 37.2552333820459"},
      {name:"رامهرمز",latlng:"49.6095997368568 31.2755266688719"},
      {name:"نرجه",latlng:"49.616471811325 36.0004849822704"},
      {name:"خمام",latlng:"49.6581400985088 37.3888056759503"},
      {name:"کوهین",latlng:"49.6587555649452 36.3715077399346"},
      {name:"زهره",latlng:"49.6838122911958 30.4645423977576"},
      {name:"فرمهین",latlng:"49.6868736768383 34.5071749361995"},
      {name:"الیگودرز",latlng:"49.6937442711099 33.3995742159486"},
      {name:"سنگر",latlng:"49.6957833277985 37.1788694499773"},
      {name:"امیدیه",latlng:"49.7027273875908 30.7606125187229"},
      {name:"تاکستان",latlng:"49.7029248390847 36.0768129052797"},
      {name:"نوبران",latlng:"49.7061561974734 35.1292932526308"},
      {name:"هندیجان",latlng:"49.7168897206131 30.2292773392365"},
      {name:"شهر اراک",latlng:"49.7313669741739 34.0900599051495"},
      {name:"دانسفهان",latlng:"49.7440119602456 35.8149934954243"},
      {name:"اسفرورین",latlng:"49.7502373179318 35.947210283683"},
      {name:"بره سر",latlng:"49.7525264456702 36.7769245602209"},
      {name:"خشکبیجار",latlng:"49.757021825799 37.3744941002324"},
      {name:"شال",latlng:"49.7659070148057 35.8979407429172"},
      {name:"کوچصفهان",latlng:"49.7739828769301 37.2762821177112"},
      {name:"جیرنده",latlng:"49.7920313343234 36.7029415104587"},
      {name:"میداود",latlng:"49.8148119818278 31.3714665617452"},
      {name:"لولمان",latlng:"49.8190893760995 37.2566277455527"},
      {name:"ارداق",latlng:"49.8268399120191 36.0526537166738"},
      {name:"آغاجاری",latlng:"49.8287224172246 30.6984827794462"},
      {name:"غرق آباد",latlng:"49.8312753116078 35.1102016908392"},
      {name:"جایزان",latlng:"49.8534469278635 30.8759778172999"},
      {name:"داودآباد",latlng:"49.8548049361223 34.2945187991166"},
      {name:"لشت نشاء",latlng:"49.8593292131518 37.3585815669457"},
      {name:"ایذه",latlng:"49.8702511970038 31.8331773863456"},
      {name:"سیاهکل",latlng:"49.87307791576 37.1543995161684"},
      {name:"قورچی باشی",latlng:"49.8791330595183 33.6753445342198"},
      {name:"باغ ملک",latlng:"49.8862370332909 31.5282008276748"},
      {name:"قلعه تل",latlng:"49.8889021796909 31.6281693313419"},
      {name:"محمودآبادنمونه",latlng:"49.8991118498903 36.2909576955466"},
      {name:"دیلمان",latlng:"49.9083154113736 36.896372914572"},
      {name:"اقبالیه",latlng:"49.9243569285815 36.2298777836157"},
      {name:"کیاشهر",latlng:"49.9309083286979 37.4233841473273"},
      {name:"کارچان",latlng:"49.9332224907543 34.1003033009048"},
      {name:"آستانه اشرفیه",latlng:"49.9372778842597 37.266517563618"},
      {name:"سگزآباد",latlng:"49.938601469619 35.7730883487443"},
      {name:"رازقان",latlng:"49.9562435854294 35.3306042289591"},
      {name:"لاهیجان",latlng:"50.0048575704591 37.2041144747214"},
      {name:"رودبنه",latlng:"50.0058740077066 37.2560919307091"},
      {name:"آشتیان",latlng:"50.0072558703938 34.5213042413539"},
      {name:"شهر قزوین",latlng:"50.0157861682564 36.2802837104404"},
      {name:"تفرش",latlng:"50.0231996939812 34.6877984947277"},
      {name:"بویین زهرا",latlng:"50.0263739365883 35.7857694480232"},
      {name:"الوند",latlng:"50.0604146396511 36.1861019240221"},
      {name:"خمین",latlng:"50.0823086381227 33.6350361318952"},
      {name:"صیدون",latlng:"50.0916440335946 31.3674117429077"},
      {name:"افوس",latlng:"50.0921334568424 33.0239738668597"},
      {name:"لیکک",latlng:"50.0948365147974 30.9064449071636"},
      {name:"اطاقور",latlng:"50.1133134357697 37.1088235388856"},
      {name:"بیدستان",latlng:"50.1219543853043 36.2308071337238"},
      {name:"چلگرد",latlng:"50.1237906191297 32.4665346243008"},
      {name:"فریدونشهر",latlng:"50.1399404921782 32.937264155814"},
      {name:"شریفیه",latlng:"50.1464043331446 36.2137919756985"},
      {name:"لنگرود",latlng:"50.1529054539249 37.1913353527311"},
      {name:"بویین ومیاندشت",latlng:"50.1551536947304 33.073189759507"},
      {name:"خاکعلی",latlng:"50.174973364841 36.1283503108117"},
      {name:"کومله",latlng:"50.180697655708 37.1447328808751"},
      {name:"بندردیلم",latlng:"50.1812327366666 30.0353540556011"},
      {name:"محمدیه",latlng:"50.1831768203007 36.2235775372452"},
      {name:"املش",latlng:"50.1877025532062 37.0945420551416"},
      {name:"برف انبار",latlng:"50.192758723531 32.9962638631957"},
      {name:"رازمیان",latlng:"50.2098540873042 36.5410695712972"},
      {name:"شلمان",latlng:"50.2178206493541 37.1580130158934"},
      {name:"رانکوه",latlng:"50.2374774831605 37.0539101686122"},
      {name:"چاف و چمخاله",latlng:"50.2413355222306 37.2486756214264"},
      {name:"بهبهان",latlng:"50.2416895515145 30.5914344762745"},
      {name:"دستجرد",latlng:"50.2469199041799 34.5497219073754"},
      {name:"امام حسن",latlng:"50.2686635461299 29.8376874982719"},
      {name:"گلپایگان",latlng:"50.2819768508472 33.4542363671563"},
      {name:"دهدز",latlng:"50.2903429043886 31.7092513079214"},
      {name:"رودسر",latlng:"50.3006010696801 37.1374618826368"},
      {name:"خوانسار",latlng:"50.3176287340768 33.2364877478816"},
      {name:"خارک",latlng:"50.3205522341759 29.2505162690202"},
      {name:"رحیم آباد",latlng:"50.333475867896 37.0276047605506"},
      {name:"خشکرود",latlng:"50.3340020434409 35.3983302718605"},
      {name:"گوگد",latlng:"50.3487697631853 33.4736532014431"},
      {name:"شهر ساوه",latlng:"50.3602334515472 35.0291987620269"},
      {name:"اشتهارد",latlng:"50.3676590702402 35.7229575459657"},
      {name:"سودجان",latlng:"50.3940501804786 32.5220577336847"},
      {name:"کلاچای",latlng:"50.3954636453304 37.0761551406825"},
      {name:"دیشموک",latlng:"50.4009395722065 31.2990640987479"},
      {name:"واجارگاه",latlng:"50.407248996856 37.0393742297126"},
      {name:"داران",latlng:"50.417152816399 32.9920403755058"},
      {name:"لنده",latlng:"50.4247578978971 30.9781555893166"},
      {name:"قلعه رییسی",latlng:"50.4491452101743 31.1874788057252"},
      {name:"سوق",latlng:"50.4582327679029 30.8557763601106"},
      {name:"محلات",latlng:"50.4645129644078 33.9002224038584"},
      {name:"گلشهر",latlng:"50.4690209180951 33.5161953720654"},
      {name:"باباحیدر",latlng:"50.470817417518 32.3276307395451"},
      {name:"معلم کلایه",latlng:"50.4785478026923 36.4495088626965"},
      {name:"دامنه",latlng:"50.4875515280085 33.0174515829839"},
      {name:"مامونیه",latlng:"50.501703522612 35.3011786232804"},
      {name:"جعفریه",latlng:"50.5186357618685 34.7713953119857"},
      {name:"بندرگناوه",latlng:"50.5248568516499 29.5851532437295"},
      {name:"آبیک",latlng:"50.5326566046893 36.0341541828666"},
      {name:"فارسان",latlng:"50.5601862964387 32.2567504616299"},
      {name:"چابکسر",latlng:"50.560428515574 36.9770532146727"},
      {name:"نیمور",latlng:"50.5678492021862 33.8860119431408"},
      {name:"زاویه",latlng:"50.5683053235228 35.3813929662362"},
      {name:"رزوه",latlng:"50.5692229953542 32.8352635642621"},
      {name:"دهدشت",latlng:"50.5712509682403 30.7950071376939"},
      {name:"نظرآباد",latlng:"50.5972771757898 35.9678149039649"},
      {name:"پردنجان",latlng:"50.6042850783029 32.2528653116992"},
      {name:"سلفچگان",latlng:"50.6062978847801 34.5798297756019"},
      {name:"تنکمان",latlng:"50.6153682291672 35.8911723440168"},
      {name:"چادگان",latlng:"50.6235242686665 32.7719160632732"},
      {name:"بندرریگ",latlng:"50.6285395715047 29.4891566814927"},
      {name:"منج",latlng:"50.6286652071313 31.538590138589"},
      {name:"اردل",latlng:"50.6524435582646 31.9944907609821"},
      {name:"رامسر",latlng:"50.6590555438227 36.9181025728571"},
      {name:"سورشجان",latlng:"50.6690840419831 32.3166552759743"},
      {name:"دلیجان",latlng:"50.6750987195729 33.9849468663147"},
      {name:"پرندک",latlng:"50.679853325603 35.3653981062861"},
      {name:"جونقان",latlng:"50.6822000738476 32.1508048200338"},
      {name:"هشتگرد",latlng:"50.6855524280453 35.9579082115069"},
      {name:"لای بید",latlng:"50.6944929565412 33.4581925753649"},
      {name:"کتالم وسادات شهر",latlng:"50.7152225799777 36.8790034078302"},
      {name:"شهرجدیدهشتگرد",latlng:"50.7241861048119 35.9833112716321"},
      {name:"ناغان",latlng:"50.7399004051993 31.9359619500431"},
      {name:"بن",latlng:"50.7476380931742 32.5379435435582"},
      {name:"چرام",latlng:"50.7488101648859 30.7507131048718"},
      {name:"وردنجان",latlng:"50.7643920832145 32.4719142712433"},
      {name:"طالقان",latlng:"50.7680133875973 36.1753112683686"},
      {name:"دستنا",latlng:"50.7714264916343 32.0645697433406"},
      {name:"کوهسار",latlng:"50.7759238228539 35.9504508781606"},
      {name:"گلسار",latlng:"50.7762754856548 35.9097652954955"},
      {name:"نافچ",latlng:"50.785298388462 32.4162546128445"},
      {name:"هفشجان",latlng:"50.7869036608445 32.2278017455862"},
      {name:"شیرود",latlng:"50.7928842592789 36.8453775595166"},
      {name:"دوگنبدان",latlng:"50.7929788189244 30.3560559261885"},
      {name:"ماهدشت",latlng:"50.8051796323668 35.7247691288701"},
      {name:"شلمزار",latlng:"50.812379755881 32.0432517160087"},
      {name:"لردگان",latlng:"50.8304391919327 31.5114634471396"},
      {name:"طاقانک",latlng:"50.8402934278623 32.2177978080836"},
      {name:"چهارباغ",latlng:"50.8423062258606 35.8453057440236"},
      {name:"صفادشت",latlng:"50.8466882384924 35.6914624792532"},
      {name:"نراق",latlng:"50.8471519465984 34.0126802818328"},
      {name:"عسگران",latlng:"50.8519436572725 32.8680217482853"},
      {name:"شهر قم",latlng:"50.8546794502445 34.6226646109351"},
      {name:"شهرکرد",latlng:"50.8567844085864 32.3289180514789"},
      {name:"کهک",latlng:"50.8647338140054 34.3931123984343"},
      {name:"خرم آباد",latlng:"50.8687847126591 36.780739736768"},
      {name:"شهر بوشهر",latlng:"50.8693790064712 28.9282861746905"},
      {name:"تنکابن",latlng:"50.872047844622 36.8153635466092"},
      {name:"کمال شهر",latlng:"50.8785923598369 35.8642803524269"},
      {name:"گهرو",latlng:"50.8886217216561 32.0095197424701"},
      {name:"کیان",latlng:"50.8888905031262 32.2838239974169"},
      {name:"گراب سفلی",latlng:"50.8975920356648 30.9422307690566"},
      {name:"محمدشهر",latlng:"59.0174595602213 32.8756171172549"},
      {name:"سامان",latlng:"50.9063398896342 32.4460055276356"},
      {name:"مشکین دشت",latlng:"50.9432894547585 35.7446191268101"},
      {name:"دهق",latlng:"50.9569408033704 33.104911427579"},
      {name:"شهر کرج",latlng:"50.9621543477731 35.8064468905577"},
      {name:"ملارد",latlng:"50.9796536068615 35.6794222217326"},
      {name:"فرخ شهر",latlng:"50.9797412392194 32.2737571193102"},
      {name:"شبانکاره",latlng:"50.9929260456258 29.4694185323536"},
      {name:"وحیدیه",latlng:"51.0204103446595 35.6005264175335"},
      {name:"چغادک",latlng:"51.0236780459456 28.9796040253619"},
      {name:"اندیشه",latlng:"51.024205327093 35.7033215318045"},
      {name:"قنوات",latlng:"51.025662530827 34.6133859401043"},
      {name:"شهر شهریار",latlng:"51.0430769972842 35.6599751248741"},
      {name:"نشتارود",latlng:"51.0444743059051 36.7392464039914"},
      {name:"بلداجی",latlng:"51.056654391982 31.9325964016889"},
      {name:"فردوسیه",latlng:"51.0598436577005 35.6051444550564"},
      {name:"آلونی",latlng:"51.0606605930653 31.5503812868738"},
      {name:"گرمدره",latlng:"51.0641110248356 35.7476636596749"},
      {name:"آب پخش",latlng:"51.0662088915823 29.3654926362298"},
      {name:"دلوار",latlng:"51.0680542708558 28.7603110811108"},
      {name:"علویجه",latlng:"51.0774979020626 33.0511353058603"},
      {name:"مارگون",latlng:"51.0807028574116 30.9943634245705"},
      {name:"رباطکریم",latlng:"51.0819499584022 35.4775707630973"},
      {name:"شاهدشهر",latlng:"51.0841745961334 35.5734418741857"},
      {name:"عباس اباد",latlng:"51.1129653813075 36.7199447615593"},
      {name:"قدس",latlng:"51.1137367504245 35.7101076963855"},
      {name:"سعد آباد",latlng:"51.1154012592796 29.3855992162662"},
      {name:"صباشهر",latlng:"51.1175194695525 35.5814428069845"},
      {name:"نصیرآباد",latlng:"51.1396883109218 35.4833824551595"},
      {name:"کلاردشت",latlng:"51.1445386963899 36.4913247035657"},
      {name:"گندمان",latlng:"51.147603958577 31.8645937152373"},
      {name:"باغستان",latlng:"51.1490006012917 35.6264840833836"},
      {name:"نیاسر",latlng:"51.1492372338433 33.9735706193124"},
      {name:"تیران",latlng:"51.1542168993329 32.7004534007148"},
      {name:"باشت",latlng:"51.1585107274819 30.3603913791584"},
      {name:"گلستان",latlng:"51.1642629397622 35.5182158820599"},
      {name:"نسیم شهر",latlng:"51.1676936181125 35.5571495672182"},
      {name:"اسارا",latlng:"51.1708716091225 36.0293880968382"},
      {name:"سفیددشت",latlng:"51.1863452250187 32.1270268329857"},
      {name:"وزوان",latlng:"51.1869879133598 33.4238868655031"},
      {name:"باغ بهادران",latlng:"51.1898224114714 32.3773118543214"},
      {name:"چرمهین",latlng:"51.1963909049635 32.3406496835442"},
      {name:"سلمان شهر",latlng:"51.2014306819826 36.7018712915042"},
      {name:"فرادبنه",latlng:"51.2093854056598 32.0070476898424"},
      {name:"برازجان",latlng:"51.2107497688729 29.2684529985809"},
      {name:"جوشقان وکامو",latlng:"51.2271489996418 33.5936459938337"},
      {name:"برزک",latlng:"51.2288809127446 33.7801385746135"},
      {name:"شهر اسلامشهر",latlng:"51.2296930052978 35.5360517641619"},
      {name:"وحدتیه",latlng:"51.2387088414686 29.4855836401145"},
      {name:"حسن آباد",latlng:"51.240846987625 35.3723286011353"},
      {name:"کلارآباد",latlng:"51.257353044573 36.6872390803829"},
      {name:"پاتاوه",latlng:"51.2657101516911 30.956058604338"},
      {name:"مال خلیفه",latlng:"51.2657105744825 31.2897532917125"},
      {name:"مشکات",latlng:"51.2685772534445 34.1762133521227"},
      {name:"زاینده رود",latlng:"51.2729643293507 32.3864433847795"},
      {name:"اهرم",latlng:"51.2774200839178 28.8842763598095"},
      {name:"بروجن",latlng:"51.2861244497218 31.9673723574133"},
      {name:"دالکی",latlng:"51.2915157029124 29.4299834770098"},
      {name:"مرزن آباد",latlng:"51.2969668702616 36.4560557069383"},
      {name:"چهاردانگه",latlng:"51.3096694148702 35.6031196050138"},
      {name:"سده لنجان",latlng:"51.3196431816362 32.3757060328913"},
      {name:"نقنه",latlng:"51.3202441384414 31.9326889643386"},
      {name:"چیتاب",latlng:"51.3254356887068 30.7953508058479"},
      {name:"ونک",latlng:"51.3257120651893 31.527443738516"},
      {name:"خشت",latlng:"51.3379836884675 29.5625306606354"},
      {name:"چمگردان",latlng:"51.342131064887 32.3924225113821"},
      {name:"سفیدشهر",latlng:"51.353194995315 34.1244940956176"},
      {name:"نجف آباد",latlng:"51.3570333825069 32.6422981535396"},
      {name:"کهریزک",latlng:"51.3611610472445 35.5172195851965"},
      {name:"جوزدان",latlng:"51.3703017578315 32.5576311852185"},
      {name:"ورنامخواست",latlng:"51.3760936544452 32.3594293428181"},
      {name:"خورموج",latlng:"51.3797154753506 28.6525822016998"},
      {name:"زرین شهر",latlng:"51.3878137245871 32.3895117766095"},
      {name:"شهر تهران",latlng:"51.3908690241499 35.716325325699"},
      {name:"کنارتخته",latlng:"51.3928413798606 29.5360123651583"},
      {name:"باقرشهر",latlng:"51.4012924770239 35.5322551292263"},
      {name:"فولادشهر",latlng:"51.4015997881494 32.4837103495442"},
      {name:"کاشان",latlng:"51.4132257694956 33.9842349023263"},
      {name:"چالوس",latlng:"51.4254802043262 36.6574471651665"},
      {name:"قمصر",latlng:"51.4293205025556 33.7500453656529"},
      {name:"نوش آباد",latlng:"51.4358072156647 34.0793182558476"},
      {name:"کرکوند",latlng:"51.4364247953361 32.3481222177103"},
      {name:"گلدشت",latlng:"51.4460909510587 32.629851927894"},
      {name:"کلمه",latlng:"51.4587446094044 28.9430957055455"},
      {name:"ایمانشهر",latlng:"51.4612041382867 32.4856607859527"},
      {name:"سی سخت",latlng:"51.4614654244579 30.8583399068196"},
      {name:"بردخون",latlng:"51.4742741109611 28.0595867555911"},
      {name:"کهریزسنگ",latlng:"51.4764316699905 32.6321797989519"},
      {name:"آران وبیدگل",latlng:"51.4791493456086 34.0569299805159"},
      {name:"کوشک",latlng:"51.4998786729858 32.6374428660834"},
      {name:"مجلسی",latlng:"51.5000725258472 32.1971686223313"},
      {name:"نوشهر",latlng:"51.5044510762454 36.6482771077458"},
      {name:"مبارکه",latlng:"51.5088696558241 32.3521331652215"},
      {name:"فلاورجان",latlng:"51.5103012446487 32.5521975785266"},
      {name:"فشم",latlng:"51.5109595329572 35.9330952119687"},
      {name:"دیزیچه",latlng:"51.5205401618549 32.3914133617183"},
      {name:"کاکی",latlng:"51.5252360540089 28.3408760739788"},
      {name:"تنگ ارم",latlng:"51.5299782862898 29.1532403228423"},
      {name:"مصیری",latlng:"51.5300052519508 30.2418851473259"},
      {name:"خمینی شهر",latlng:"51.5362029045173 32.6887486664567"},
      {name:"کلیشادوسودرجان",latlng:"51.5376496600059 32.546052462213"},
      {name:"بهاران شهر",latlng:"51.5402336251636 32.5196430688926"},
      {name:"درچه",latlng:"51.5459660413674 32.6090555147915"},
      {name:"مادوان",latlng:"51.5499463917085 30.7194287416477"},
      {name:"شاهین شهر",latlng:"51.5537756339379 32.8637562933547"},
      {name:"پیربکران",latlng:"51.5547202541035 32.4687994293638"},
      {name:"طالخونچه",latlng:"51.5635510783527 32.2635357148778"},
      {name:"زیباشهر",latlng:"51.5690426217808 32.3849127171409"},
      {name:"سمیرم",latlng:"51.5696670295333 31.4058636010088"},
      {name:"ابریشم",latlng:"51.5732586765224 32.5724457415636"},
      {name:"خومه زار",latlng:"51.5746830917632 30.0112351713283"},
      {name:"یاسوج",latlng:"51.5808715558956 30.6691585070087"},
      {name:"قرچک",latlng:"51.5875038257468 35.4274212475132"},
      {name:"قایمیه",latlng:"51.5907568510012 29.8494741882688"},
      {name:"پول",latlng:"51.5924587028171 36.3949300071855"},
      {name:"کمه",latlng:"51.5941178507093 31.0715894804415"},
      {name:"گرگاب",latlng:"51.5959334249628 32.8632125972537"},
      {name:"گزبرخوار",latlng:"51.619862295688 32.808694212039"},
      {name:"فرون اباد",latlng:"51.6251319413037 35.5121896253356"},
      {name:"ورامین",latlng:"51.6365534298262 35.3483240653782"},
      {name:"لواسان",latlng:"51.6399394799217 35.8182538150203"},
      {name:"خورزوق",latlng:"51.6454494938239 32.7763738956163"},
      {name:"دهاقان",latlng:"51.6537113682962 31.9396991559257"},
      {name:"شهر اصفهان",latlng:"51.6576574330687 32.6658681931438"},
      {name:"کازرون",latlng:"51.658190682741 29.6173222204533"},
      {name:"دستگرد",latlng:"51.664693647874 32.8006623132167"},
      {name:"جوادآباد",latlng:"51.6750899447554 35.2083969774981"},
      {name:"پاکدشت",latlng:"51.6773675443614 35.4919929452943"},
      {name:"نودان",latlng:"51.6951221871697 29.8035368659954"},
      {name:"دولت آباد",latlng:"59.5191974827043 35.2855684338875"},
      {name:"پیشوا",latlng:"51.7218598946962 35.3066970033991"},
      {name:"حنا",latlng:"51.7242849974368 31.1974048323634"},
      {name:"شاپورآباد",latlng:"51.7432124441462 32.8441565366266"},
      {name:"گلشن",latlng:"51.7546154345078 31.9301223042653"},
      {name:"شنبه",latlng:"51.7630221009789 28.3962127051505"},
      {name:"ابوزیدآباد",latlng:"51.7648043907484 33.904667143468"},
      {name:"آبدان",latlng:"51.7675914839892 28.079768870904"},
      {name:"حبیب آباد",latlng:"51.7740174139244 32.8288286271361"},
      {name:"بهارستان",latlng:"51.7786366317173 32.4846797670011"},
      {name:"شریف آباد",latlng:"51.7801476153227 35.4358081726129"},
      {name:"بلده",latlng:"51.8078495696605 36.199262987696"},
      {name:"پردیس",latlng:"51.8080782841667 35.7452782520163"},
      {name:"کمشجه",latlng:"51.8094095915196 32.9053651948539"},
      {name:"قهجاورستان",latlng:"51.8348036719781 32.7037257138185"},
      {name:"بومهن",latlng:"51.8667608592151 35.730883357907"},
      {name:"منظریه",latlng:"51.8693216283484 31.9484452867624"},
      {name:"شهرضا",latlng:"51.8698084927233 32.0150174711495"},
      {name:"رودهن",latlng:"51.9128295765466 35.7285414239225"},
      {name:"نطنز",latlng:"51.9219398561203 33.5097931072031"},
      {name:"بندردیر",latlng:"51.9358610364371 27.8423212362761"},
      {name:"بالاده",latlng:"51.9395526741864 29.2866111959116"},
      {name:"دژکرد",latlng:"51.9581034110866 30.7193612423647"},
      {name:"بردستان",latlng:"51.9592067836008 27.8709404206545"},
      {name:"آبعلی",latlng:"51.9667788444423 35.7660129458672"},
      {name:"رویان",latlng:"51.9702190333529 36.5688031242057"},
      {name:"خالدآباد",latlng:"51.9839799542782 33.7072367387213"},
      {name:"اردکان",latlng:"54.0098119612308 32.3141962162691"},
      {name:"بادرود",latlng:"51.9987873408822 33.6874833417465"},
      {name:"نوجین",latlng:"52.0134076362391 29.1243706445473"},
      {name:"نور",latlng:"52.0210347365098 36.5735888800906"},
      {name:"بنک",latlng:"52.0270982458963 27.8737140642445"},
      {name:"دماوند",latlng:"52.0452834639205 35.7144820099913"},
      {name:"نصرآباد",latlng:"60.3180356321021 35.4163305032531"},
      {name:"بندرکنگان",latlng:"52.0621946589193 27.8386477588244"},
      {name:"ایوانکی",latlng:"52.0663440254091 35.3461731620886"},
      {name:"انارستان",latlng:"52.0775634120791 28.0282659560625"},
      {name:"ریز",latlng:"52.0779964828564 28.0509637477734"},
      {name:"هماشهر",latlng:"55.8110886865012 29.6414114696397"},
      {name:"فراشبند",latlng:"52.0932768247938 28.8615981863846"},
      {name:"محمدآباد",latlng:"61.4627596063381 30.8843592356343"},
      {name:"چمستان",latlng:"52.119426875143 36.4859094073153"},
      {name:"سگزی",latlng:"52.125203492958 32.6798990081391"},
      {name:"ایزدخواست",latlng:"52.1255010791486 31.5179564040467"},
      {name:"آبسرد",latlng:"52.1442014180622 35.6419594497355"},
      {name:"ایزدشهر",latlng:"52.1448338076002 36.6009228358795"},
      {name:"خانه زنیان",latlng:"52.1550619571752 29.6730170451709"},
      {name:"کیلان",latlng:"52.166134299252 35.5477494632577"},
      {name:"رینه",latlng:"52.1674589936275 35.8818459341826"},
      {name:"سده",latlng:"52.1743534988696 30.7123334697144"},
      {name:"کامفیروز",latlng:"52.1946096996486 30.3221225072459"},
      {name:"نیک آباد",latlng:"52.2016137112609 32.3045727345566"},
      {name:"گزنک",latlng:"52.225034172863 35.9055792748818"},
      {name:"دهرم",latlng:"52.3045321377692 28.491564314143"},
      {name:"جم",latlng:"52.3304068461287 27.8196736647148"},
      {name:"گرمسار",latlng:"52.3386457340727 35.2215717503904"},
      {name:"سیراف",latlng:"52.3475793934728 27.6623553857918"},
      {name:"بیضا",latlng:"52.3550757320156 30.0142636818637"},
      {name:"آمل",latlng:"52.3564524672976 36.4640572423143"},
      {name:"اردستان",latlng:"52.3735835325089 33.3765959263062"},
      {name:"اژیه",latlng:"52.3824643152187 32.4435291895971"},
      {name:"هرند",latlng:"52.4375701539844 32.5731892837702"},
      {name:"کوهپایه",latlng:"52.4378055375572 32.7130666851601"},
      {name:"دابودشت",latlng:"52.4549719303853 36.481419317018"},
      {name:"حسن اباد",latlng:"52.6237025407639 32.1404774066158"},
      {name:"سرخرود",latlng:"52.4562960144913 36.6731282557022"},
      {name:"بهمن",latlng:"52.4852631717516 31.1935789215774"},
      {name:"زواره",latlng:"52.48728605798 33.4459460350083"},
      {name:"آرادان",latlng:"52.4914349841868 35.2579803999614"},
      {name:"شهرصدرا",latlng:"52.4983276478521 29.7969192373855"},
      {name:"ارجمند",latlng:"52.5127022399322 35.8185156028445"},
      {name:"شهر شیراز",latlng:"52.517556323656 29.6094958685244"},
      {name:"صغاد",latlng:"52.5194585412702 31.1948614490679"},
      {name:"فریدونکنار",latlng:"52.5234524621727 36.6822062050768"},
      {name:"خوش رودپی",latlng:"52.5642500624153 36.3731373592587"},
      {name:"زرگرمحله",latlng:"52.5750176921819 36.5211891850187"},
      {name:"نخل تقی",latlng:"52.5916284268855 27.4992052254863"},
      {name:"رامجرد",latlng:"52.5929532897339 30.0751396094503"},
      {name:"عسلویه",latlng:"52.613391992861 27.4728205398441"},
      {name:"گلوگاه",latlng:"53.8095137675806 36.7309603369993"},
      {name:"کله بست",latlng:"52.6270576077956 36.6385406036862"},
      {name:"ورزنه",latlng:"52.6500926220216 32.424731419497"},
      {name:"بابلسر",latlng:"52.6525322286742 36.6993993241896"},
      {name:"آباده",latlng:"52.652546648773 31.1689689492094"},
      {name:"لپویی",latlng:"52.6548801652401 29.8012201877988"},
      {name:"گتاب",latlng:"52.6550198773951 36.424889401203"},
      {name:"گله دار",latlng:"52.6588277155668 27.6587250090729"},
      {name:"امیرکلا",latlng:"52.6651140866765 36.5997552775276"},
      {name:"اسیر",latlng:"52.6686766460518 27.7274932132252"},
      {name:"تودشک",latlng:"52.6752820665138 32.7258839851877"},
      {name:"شهر بابل",latlng:"52.6763740406577 36.5446341290759"},
      {name:"زرقان",latlng:"52.6874761648368 29.7622191118466"},
      {name:"کوار",latlng:"52.6905210339901 29.2031166473933"},
      {name:"اقلید",latlng:"52.6989651656535 30.8935826163081"},
      {name:"مرزیکلا",latlng:"52.7358393476184 36.3605479476333"},
      {name:"میمند",latlng:"52.7536370098138 28.875096066907"},
      {name:"بهنمیر",latlng:"52.7612819602256 36.6660678529153"},
      {name:"فیروزکوه",latlng:"52.7667920872933 35.7531013956829"},
      {name:"مرودشت",latlng:"52.807213806863 29.8763692101972"},
      {name:"کیاکلا",latlng:"52.8123747453374 36.5759062554447"},
      {name:"آلاشت",latlng:"52.8313702865363 36.0663761554934"},
      {name:"سورمق",latlng:"52.845960858454 31.032479535602"},
      {name:"قایم شهر",latlng:"52.8613033920334 36.4640702357852"},
      {name:"کوشکنار",latlng:"52.8645006793386 27.2528774114426"},
      {name:"شیرگاه",latlng:"52.8820645072542 36.3038549829981"},
      {name:"مهر",latlng:"52.8821024768148 27.5528881463312"},
      {name:"جویبار",latlng:"52.9035774856622 36.6412687105122"},
      {name:"کوهی خیل",latlng:"52.9058042441612 36.6876599149928"},
      {name:"داریان",latlng:"52.9317051977518 29.5606556126604"},
      {name:"دوزه",latlng:"52.9588870492444 28.6995522298847"},
      {name:"کوهنجان",latlng:"52.9605692651283 29.2319952278408"},
      {name:"افزر",latlng:"52.9666048696521 28.3431998981716"},
      {name:"زیرآب",latlng:"52.9722811857131 36.1797743270287"},
      {name:"علامرودشت",latlng:"53.0014751428332 27.6242721080423"},
      {name:"سیدان",latlng:"53.0046648087412 30.0049481712442"},
      {name:"قیر",latlng:"53.0397172969426 28.4801414419706"},
      {name:"پارسیان",latlng:"53.044858864828 27.2079594527461"},
      {name:"پل سفید",latlng:"53.0477602845734 36.1255249594553"},
      {name:"وراوی",latlng:"53.0522527732716 27.4658890760717"},
      {name:"شهر ساری",latlng:"53.0651000861213 36.5599555149256"},
      {name:"نایین",latlng:"53.0730749135309 32.8527115460226"},
      {name:"کارزین (فتح آباد)",latlng:"53.1111645323387 28.3874505740112"},
      {name:"سعادت شهر",latlng:"53.1302941334121 30.0753167690055"},
      {name:"بافران",latlng:"53.1411269204927 32.8374508362996"},
      {name:"امام شهر",latlng:"53.1518034999698 28.4465468580443"},
      {name:"صفاشهر",latlng:"53.1650164662779 30.6000936389265"},
      {name:"لامرد",latlng:"53.1826157177913 27.340447157701"},
      {name:"سرخه",latlng:"53.2098660073046 35.4646181854995"},
      {name:"سورک",latlng:"53.2107494065788 36.5966980517373"},
      {name:"باب انار",latlng:"53.2109312486853 28.9718767186583"},
      {name:"سروستان",latlng:"53.2236453142157 29.2717936546885"},
      {name:"قادراباد",latlng:"53.2562118113616 30.2750828369598"},
      {name:"ابرکوه",latlng:"53.2606507298081 31.1279970178538"},
      {name:"فریم",latlng:"53.2712031769756 36.172814200698"},
      {name:"نکا",latlng:"53.2920187059568 36.6479179881599"},
      {name:"ارسنجان",latlng:"53.3057147967394 29.9181733286557"},
      {name:"خرامه",latlng:"53.3126477558792 29.5145104344595"},
      {name:"خاوران",latlng:"53.3275466516701 28.9284413553155"},
      {name:"مبارک آباددیز",latlng:"53.3282363829399 28.3590086291017"},
      {name:"درجزین",latlng:"53.3337528643946 35.6484504102136"},
      {name:"شهمیرزاد",latlng:"53.3393642145147 35.7701186468764"},
      {name:"مهدی شهر",latlng:"53.3444493325562 35.7035729142484"},
      {name:"مهردشت",latlng:"53.3486501107932 31.0317138014797"},
      {name:"سمنان",latlng:"53.3960921408521 35.5756469704475"},
      {name:"رستمکلا",latlng:"53.425325166761 36.6791504291797"},
      {name:"خنج",latlng:"53.4316638349794 27.8854803134409"},
      {name:"بیرم",latlng:"53.514954603341 27.4344145792323"},
      {name:"کیاسر",latlng:"53.5400355784291 36.2385413472718"},
      {name:"بهشهر",latlng:"53.5416657499956 36.6932125189875"},
      {name:"ندوشن",latlng:"53.5500481296906 32.0297791080316"},
      {name:"جهرم",latlng:"53.5632588308279 28.50185029279"},
      {name:"اشکنان",latlng:"53.6065924654095 27.2294385295589"},
      {name:"بوانات",latlng:"53.6307485085876 30.4667078368454"},
      {name:"عقدا",latlng:"53.6333435123099 32.442505741263"},
      {name:"قطب آباد",latlng:"53.6396873847776 28.6403655414606"},
      {name:"خلیل شهر",latlng:"53.6418879046394 36.7028990122466"},
      {name:"فسا",latlng:"53.642020139697 28.94054558061"},
      {name:"اهل",latlng:"53.6606897179352 27.2114295376247"},
      {name:"انارک",latlng:"53.6963558993387 33.3080884863475"},
      {name:"کره ای",latlng:"53.7136534269221 30.0256106048392"},
      {name:"آباده طشک",latlng:"53.7292105525363 29.8091600988483"},
      {name:"رونیز",latlng:"53.7688912156349 29.1915721305526"},
      {name:"زاهدشهر",latlng:"53.8047222048805 28.7485931389067"},
      {name:"نوبندگان",latlng:"53.8253284419228 28.8546061577964"},
      {name:"عمادده",latlng:"53.8552044093112 27.4421074366073"},
      {name:"حسامی",latlng:"53.8734917218769 29.9720973106398"},
      {name:"نوکنده",latlng:"53.9140260618655 36.7399556420579"},
      {name:"خضرآباد",latlng:"53.951427494118 31.8673848023548"},
      {name:"بندرگز",latlng:"53.9534636812869 36.7722229356171"},
      {name:"کیش",latlng:"53.9682589415229 26.5344695152189"},
      {name:"جویم",latlng:"53.9822591501085 28.2645311532885"},
      {name:"بفروییه",latlng:"53.9853733088598 32.2769619828876"},
      {name:"احمدآباد",latlng:"53.988859485904 32.357633045378"},
      {name:"ششده",latlng:"53.9939119458494 28.9515983504215"},
      {name:"اوز",latlng:"54.0052973437768 27.7612895619132"},
      {name:"میبد",latlng:"54.0201121965432 32.2383780320181"},
      {name:"استهبان",latlng:"54.0421212695278 29.1280922066201"},
      {name:"بنارویه",latlng:"54.0479517492413 28.0847391669848"},
      {name:"بندرترکمن",latlng:"54.0741339809292 36.9038536891273"},
      {name:"گمیش تپه",latlng:"54.0769564883931 37.0708164304345"},
      {name:"کردکوی",latlng:"54.1125567480784 36.7869671177692"},
      {name:"گراش",latlng:"54.1393877104449 27.6538477220656"},
      {name:"امیریه",latlng:"54.14150904936 36.026990955111"},
      {name:"دبیران",latlng:"54.1911241861157 28.4068307826336"},
      {name:"اشکذر",latlng:"54.2049781730921 32.0107311304733"},
      {name:"تفت",latlng:"54.2080380202369 31.7538722138855"},
      {name:"مروست",latlng:"54.2111798832345 30.478263554532"},
      {name:"دیباج",latlng:"54.2268661152024 36.4276383056362"},
      {name:"سیمین شهر",latlng:"54.2287746162664 37.014629523236"},
      {name:"ایج",latlng:"54.2452006765343 29.0209612940109"},
      {name:"زارچ",latlng:"54.2538882203833 31.9896184316315"},
      {name:"چارک",latlng:"54.2723280299111 26.7321808178789"},
      {name:"شاهدیه",latlng:"54.279622437872 31.9438801487633"},
      {name:"جناح",latlng:"54.2875659572225 27.0201021930433"},
      {name:"لار",latlng:"54.3266669886695 27.6660242470989"},
      {name:"نی ریز",latlng:"54.3341122163374 29.2046099930427"},
      {name:"شهرپیر",latlng:"54.3358985580846 28.3092376878075"},
      {name:"مشکان",latlng:"54.336722685382 29.4749819176479"},
      {name:"دامغان",latlng:"54.3427470538183 36.1666222892236"},
      {name:"خور",latlng:"55.0840257816838 33.7740980706042"},
      {name:"شهر یزد",latlng:"54.3467396636466 31.8927999145082"},
      {name:"بستک",latlng:"54.3638736004827 27.1938993828015"},
      {name:"هرات",latlng:"54.3714985493714 30.0522170556342"},
      {name:"لطیفی",latlng:"54.3843559579512 27.6891704282636"},
      {name:"حمیدیا",latlng:"54.4001110064748 31.8221992766962"},
      {name:"جندق",latlng:"54.4147925347616 34.0384641477805"},
      {name:"حاجی آباد",latlng:"59.9987462368351 33.601722414817"},
      {name:"شهر گرگان",latlng:"54.4362529662254 36.8403635007543"},
      {name:"مهریز",latlng:"54.4415827036967 31.5806407825335"},
      {name:"آق قلا",latlng:"54.4531924911217 37.0131332850987"},
      {name:"جلین",latlng:"54.5360613844114 36.8517127180292"},
      {name:"داراب",latlng:"54.5439321521717 28.7494773877133"},
      {name:"سرخنکلاته",latlng:"54.5691803550475 36.8901547447648"},
      {name:"انبارآلوم",latlng:"54.6185275155128 37.1349562329327"},
      {name:"مجن",latlng:"54.6495480188904 36.4786145955439"},
      {name:"جنت شهر",latlng:"54.6878909020185 28.6521719329747"},
      {name:"قطرویه",latlng:"54.7072741057742 29.1415574463686"},
      {name:"اینچه برون",latlng:"54.7176676366375 37.4534289383809"},
      {name:"فاضل آباد",latlng:"54.7527614800875 36.9005907162406"},
      {name:"علی اباد",latlng:"54.8672989600886 36.9105277188214"},
      {name:"دهج",latlng:"54.8802406449974 30.6919667749402"},
      {name:"بندرلنگه",latlng:"54.8875344228118 26.5646931989266"},
      {name:"کنگ",latlng:"54.9374716956974 26.6059348823713"},
      {name:"فرخی",latlng:"54.94513264379 33.8438394846178"},
      {name:"شاهرود",latlng:"54.9711844205607 36.4119097920933"},
      {name:"خان ببین",latlng:"54.988177063629 37.0110001533837"},
      {name:"بسطام",latlng:"54.9975110905746 36.478317636304"},
      {name:"ابوموسی",latlng:"55.0261789310786 25.8834121952223"},
      {name:"جوزم",latlng:"55.0359967215765 30.5216800744746"},
      {name:"دلند",latlng:"55.0498085371486 37.0342668253839"},
      {name:"خورسند",latlng:"55.0793651746437 30.1633265098569"},
      {name:"شهربابک",latlng:"55.1267325009004 30.1222982200969"},
      {name:"فدامی",latlng:"55.1352783815811 28.2160637302246"},
      {name:"رامیان",latlng:"55.1429709772726 37.0175413311107"},
      {name:"نگین شهر",latlng:"55.1663762447085 37.1394430388292"},
      {name:"آزادشهر",latlng:"55.170011856684 37.0877329855663"},
      {name:"گنبدکاووس",latlng:"55.1731461253028 37.2402377691859"},
      {name:"دوبرجی",latlng:"55.1900547976752 28.3050400203074"},
      {name:"نوده خاندوز",latlng:"55.2628095065275 37.0750219819864"},
      {name:"انار",latlng:"55.2632109472937 30.8764006664264"},
      {name:"کلاته خیج",latlng:"55.2879985349934 36.6738607318622"},
      {name:"امین شهر",latlng:"55.3410520438534 30.8429681881835"},
      {name:"مینودشت",latlng:"55.3712227424302 37.2292041820118"},
      {name:"بافق",latlng:"55.3997507226582 31.6042148282022"},
      {name:"رویدر",latlng:"55.4174771008872 27.4658777607754"},
      {name:"خاتون آباد",latlng:"55.4181920193835 30.0111780809258"},
      {name:"گالیکش",latlng:"55.4339123774634 37.2695561245094"},
      {name:"کلاله",latlng:"55.4920377108428 37.3823036424428"},
      {name:"زیدآباد",latlng:"55.5357994022079 29.5995661074018"},
      {name:"خمیر",latlng:"55.5709592574562 26.9507488197055"},
      {name:"کشکوییه",latlng:"55.6453315555741 30.5288891375923"},
      {name:"میامی",latlng:"55.6531117679779 36.4100883172925"},
      {name:"شهر سیرجان",latlng:"55.6779065035898 29.4445931271108"},
      {name:"نجف شهر",latlng:"55.7105506283029 29.3834960044061"},
      {name:"بهرمان",latlng:"55.7204639591404 30.9004146136826"},
      {name:"پاریز",latlng:"55.7482885067068 29.8730257850549"},
      {name:"سرچشمه",latlng:"55.7958442814801 29.9988284116669"},
      {name:"بیارجمند",latlng:"55.8087665478363 36.0783616024111"},
      {name:"صفاییه",latlng:"55.8135482293539 30.8273233195979"},
      {name:"فین",latlng:"55.8879847402801 27.6309493364875"},
      {name:"حاجی اباد",latlng:"55.9069463367772 28.312450887787"},
      {name:"مراوه",latlng:"55.9532390836974 37.9020969722466"},
      {name:"رفسنجان",latlng:"55.9860224701739 30.3906840397349"},
      {name:"بهاباد",latlng:"56.0275606340887 31.8740995986115"},
      {name:"سوزا",latlng:"56.0628231494569 26.7820919835005"},
      {name:"درگهان",latlng:"56.0640860865416 26.95782800956"},
      {name:"درق",latlng:"56.211497039632 36.973214715233"},
      {name:"فارغان",latlng:"56.2498119740261 28.0129613298924"},
      {name:"ایور",latlng:"56.2618459431714 36.9684108109085"},
      {name:"کوهبنان",latlng:"56.2646809740431 31.4201138292935"},
      {name:"قشم",latlng:"56.2657261503957 26.9494896792422"},
      {name:"شهر بندرعباس",latlng:"56.2883938332925 27.1995144360968"},
      {name:"گرمه",latlng:"56.3021189466419 36.9787783094436"},
      {name:"ارزوییه",latlng:"56.3656658442594 28.4526977560711"},
      {name:"جاجرم",latlng:"56.3671814760501 36.9538644559318"},
      {name:"یزدان شهر",latlng:"56.3791225151499 30.8655542330224"},
      {name:"کیانشهر",latlng:"56.3817627565173 31.1535545615946"},
      {name:"هرمز",latlng:"56.4654717246602 27.0845574127748"},
      {name:"قلعه قاضی",latlng:"56.5522268129349 27.451731114166"},
      {name:"بردسیر",latlng:"56.574309100935 29.9244388424532"},
      {name:"زرند",latlng:"56.5817059292135 30.8120296360487"},
      {name:"بافت",latlng:"56.5978778175989 29.2336978641888"},
      {name:"تخت",latlng:"56.6401477351004 27.5026695396675"},
      {name:"سرگز",latlng:"56.6601405934983 27.9426891882261"},
      {name:"بزنجان",latlng:"56.6948499671357 29.2536477528862"},
      {name:"ریحان شهر",latlng:"56.7257873119142 30.7353324116153"},
      {name:"قاضی",latlng:"56.744756844257 37.4969835067507"},
      {name:"خانوک",latlng:"56.7726637633995 30.7136266513604"},
      {name:"نگار",latlng:"56.8000989520265 29.8618554555748"},
      {name:"راور",latlng:"56.8030377205053 31.2589317680001"},
      {name:"لاله زار",latlng:"56.8110320622322 29.5274003028567"},
      {name:"باغین",latlng:"56.8146783010065 30.1919809345517"},
      {name:"کاظم آباد",latlng:"56.8470965755728 30.5639971455266"},
      {name:"سنخواست",latlng:"56.8555251672071 37.1020414303593"},
      {name:"داورزن",latlng:"56.8764605914228 36.3521499174359"},
      {name:"شوقان",latlng:"56.8912874221158 37.3436380301749"},
      {name:"رابر",latlng:"56.9119520479496 29.2908931190347"},
      {name:"چترود",latlng:"56.9122014480121 30.6005876332774"},
      {name:"زنگی آباد",latlng:"56.9126385573426 30.412951104552"},
      {name:"اختیارآباد",latlng:"56.9190773881529 30.3283107255696"},
      {name:"آشخانه",latlng:"56.9240402569801 37.5587903290278"},
      {name:"عشق آباد",latlng:"58.6787417963962 36.0383185399752"},
      {name:"طبس",latlng:"56.9331710716575 33.5980817510587"},
      {name:"هجدک",latlng:"56.9971060596879 30.7598965821755"},
      {name:"پیش قلعه",latlng:"56.9993483714121 37.6502940285939"},
      {name:"گلزار",latlng:"57.0468356411912 29.7102353658371"},
      {name:"جغتای",latlng:"57.0677646700534 36.6315539084539"},
      {name:"شهر کرمان",latlng:"57.0683147154255 30.2829872828398"},
      {name:"میناب",latlng:"57.0767235793031 27.1406962183115"},
      {name:"سیریک",latlng:"57.1064801993097 26.5228138013148"},
      {name:"جوپار",latlng:"57.1117871854954 30.0542558009571"},
      {name:"راز",latlng:"57.1136147163969 37.9360968919729"},
      {name:"محی آباد",latlng:"57.1517304397955 30.0824785207409"},
      {name:"بیکا",latlng:"57.1782576811138 27.3536575387165"},
      {name:"دهبارز",latlng:"57.1889229157685 27.4425954921841"},
      {name:"زیارتعلی",latlng:"57.227127049019 27.738359980582"},
      {name:"فاریاب",latlng:"57.2284188477572 28.0949895080829"},
      {name:"ماهان",latlng:"57.2879180000081 30.0569767368769"},
      {name:"روداب",latlng:"57.307676700523 36.0238174241705"},
      {name:"شهر بجنورد",latlng:"57.3251198800512 37.4749675041555"},
      {name:"درب بهشت",latlng:"57.337906535235 29.2350536629235"},
      {name:"ارسک",latlng:"57.3732834160268 33.7005513749229"},
      {name:"نقاب",latlng:"57.4129337325256 36.7097631693155"},
      {name:"سندرک",latlng:"57.4254422602565 26.8368036350992"},
      {name:"بشرویه",latlng:"57.4286915098144 33.8679632252755"},
      {name:"راین",latlng:"57.4328873014437 29.5946532862152"},
      {name:"هشتبندی",latlng:"57.4496922410184 27.1494463380809"},
      {name:"نود‍ژ",latlng:"57.4506059293704 27.5340219078662"},
      {name:"حصارگرمخان",latlng:"57.4803846684217 37.520011571933"},
      {name:"منوجان",latlng:"57.4982092762188 27.4184815707366"},
      {name:"اسفراین",latlng:"57.5055969790861 37.0677929563841"},
      {name:"دیهوک",latlng:"57.518416855611 33.2887173281466"},
      {name:"شهر سبزوار",latlng:"57.6763151849235 36.2115042322885"},
      {name:"کهنوج",latlng:"57.7000636781355 27.9520350279591"},
      {name:"شهداد",latlng:"57.7018876683396 30.4200222079425"},
      {name:"گلباف",latlng:"57.7314619870102 29.8840361585945"},
      {name:"جیرفت",latlng:"57.7500943456743 28.687258860781"},
      {name:"اندوهجرد",latlng:"57.7541983724714 30.2511216969417"},
      {name:"ششتمد",latlng:"57.7658574657639 35.9596201161225"},
      {name:"انابد",latlng:"57.8023906682145 35.2443072202237"},
      {name:"بندرجاسک",latlng:"57.8042006485676 25.6645238727007"},
      {name:"عنبرآباد",latlng:"57.8436106373731 28.4750265038353"},
      {name:"لوجلی",latlng:"57.8575748881645 37.6075791809137"},
      {name:"قلعه گنج",latlng:"57.8700006001124 27.504976725007"},
      {name:"جبالبارز",latlng:"57.8840356621913 28.9039559345689"},
      {name:"گوهران",latlng:"57.8981561988501 26.5937027494833"},
      {name:"شیروان",latlng:"57.9285076984503 37.4023496097201"},
      {name:"شهراباد",latlng:"57.931843194902 35.14572992399"},
      {name:"دوساری",latlng:"57.9330417485075 28.4278774074866"},
      {name:"بردسکن",latlng:"57.9628898775957 35.2534186369116"},
      {name:"رودبارجنوب",latlng:"57.9900697730655 28.0351692536084"},
      {name:"سلطان آباد",latlng:"58.0368177427953 36.4030122079205"},
      {name:"کندر",latlng:"58.1505414252111 35.2097663264102"},
      {name:"مردهک",latlng:"58.1586075332071 28.3532808327203"},
      {name:"فردوس",latlng:"58.1681129275518 34.0162934538065"},
      {name:"بجستان",latlng:"58.1804921985719 34.5159378991707"},
      {name:"اسلامیه",latlng:"58.2178468096687 34.0419012651103"},
      {name:"فاروج",latlng:"58.2244390549241 37.2254083811851"},
      {name:"تیتکانلو",latlng:"58.2884957863647 37.2816498166315"},
      {name:"خلیل آباد",latlng:"58.2890804863956 35.2526112059836"},
      {name:"بم",latlng:"58.338613816703 29.0921564522441"},
      {name:"آیسک",latlng:"58.3819216475202 33.8842433015398"},
      {name:"سه قلعه",latlng:"58.3971076222179 33.6638724696769"},
      {name:"باجگیران",latlng:"58.4179149972445 37.6200182782681"},
      {name:"بروات",latlng:"58.423765525696 29.0623868012661"},
      {name:"یونسی",latlng:"58.4404755298953 34.804602794931"},
      {name:"ریوش",latlng:"58.4522185712729 35.4730665301358"},
      {name:"همت آباد",latlng:"58.4639075140702 36.2973127304589"},
      {name:"کاشمر",latlng:"58.4678425398277 35.2385812728726"},
      {name:"چکنه",latlng:"58.5005416487983 36.8186427857302"},
      {name:"قوچان",latlng:"58.5067558306075 37.1029988948226"},
      {name:"سرایان",latlng:"58.5175329527832 33.8592308638994"},
      {name:"نظام شهر",latlng:"58.5480496042405 28.911636648522"},
      {name:"فیروزه",latlng:"58.5871371628103 36.2864592280088"},
      {name:"کاخک",latlng:"58.6473297882561 34.1466659859763"},
      {name:"نرماشیر",latlng:"58.6912231896483 28.9551761632656"},
      {name:"گناباد",latlng:"58.6941355534504 34.3519515568531"},
      {name:"بار",latlng:"58.7177078758084 36.4889550446305"},
      {name:"بیدخت",latlng:"58.7646487601538 34.3455268431069"},
      {name:"فیض آباد",latlng:"58.7726180592603 35.0118736311342"},
      {name:"شهر نیشابور",latlng:"58.7968409595638 36.2075163846483"},
      {name:"خضری دشت بیاض",latlng:"58.8048944830056 34.0260480928998"},
      {name:"کدکن",latlng:"58.8773866653757 35.5930514990853"},
      {name:"فهرج",latlng:"58.882161350119 28.9433577737494"},
      {name:"خوسف",latlng:"58.886899177526 32.7789586291714"},
      {name:"نیمبلوک",latlng:"58.9380017876001 33.9106616059195"},
      {name:"نوخندان",latlng:"58.9901996858898 37.516200959012"},
      {name:"خرو",latlng:"59.0363320766135 36.1589734175624"},
      {name:"شادمهر",latlng:"59.0373055274089 35.1723242041711"},
      {name:"بایک",latlng:"59.0385913450203 35.3771787795754"},
      {name:"قدمگاه",latlng:"59.058008857229 36.1035776718632"},
      {name:"چاپشلو",latlng:"59.0761997736287 37.3497473115778"},
      {name:"درگز",latlng:"59.1110586443706 37.4439513721506"},
      {name:"درود",latlng:"59.1124527670562 36.1396397871334"},
      {name:"چناران",latlng:"59.1166015259136 36.6460678759406"},
      {name:"گلمکان",latlng:"59.1558043112464 36.4828699857411"},
      {name:"قاین",latlng:"59.1830316135723 33.7257074601746"},
      {name:"رباطسنگ",latlng:"59.1970333757764 35.5465643724536"},
      {name:"شهر بیرجند",latlng:"59.210707304322 32.8673271351313"},
      {name:"تربت حیدریه",latlng:"59.2147878484208 35.2773895207261"},
      {name:"جنگل",latlng:"59.2252509943018 34.695558320712"},
      {name:"آرین شهر",latlng:"59.2342416751124 33.3293207980884"},
      {name:"شاندیز",latlng:"59.2976897220586 36.394594263876"},
      {name:"لطف آباد",latlng:"59.337468383464 37.5145550313423"},
      {name:"طرقبه",latlng:"59.374960772562 36.3132388028838"},
      {name:"گلمورتی",latlng:"59.4479036128122 27.4807640448156"},
      {name:"مود",latlng:"59.5240896051939 32.706918811363"},
      {name:"بنت",latlng:"59.5262808741954 26.2906176517335"},
      {name:"شهر مشهد",latlng:"59.5837066076416 36.2985536507305"},
      {name:"ملک آباد",latlng:"59.5960106257875 35.9910590810268"},
      {name:"رشتخوار",latlng:"59.6259013000964 34.9699977616755"},
      {name:"فنوج",latlng:"59.647254862249 26.5753335907867"},
      {name:"قهستان",latlng:"59.7175474063576 33.1642051624949"},
      {name:"فریمان",latlng:"59.7296160396124 35.7657722738839"},
      {name:"کلات",latlng:"59.7627355818866 36.9973306106723"},
      {name:"رضویه",latlng:"59.7689506091363 36.2087478662973"},
      {name:"اسفدن",latlng:"59.782164822907 33.6398711087081"},
      {name:"سربیشه",latlng:"59.7993134592568 32.5738982687327"},
      {name:"زهان",latlng:"59.8017742612009 33.4136207967122"},
      {name:"فرهادگرد",latlng:"59.848090794512 35.7023358514744"},
      {name:"قاسم آباد",latlng:"59.8639333075226 34.3670744213023"},
      {name:"شهرزو",latlng:"59.9285965096975 36.7430200557949"},
      {name:"قلندرآباد",latlng:"59.9528261715821 35.6005695921137"},
      {name:"نصرت آباد",latlng:"59.9729038808493 29.8721440535166"},
      {name:"سلامی",latlng:"59.9765922764121 34.7458516717222"},
      {name:"شوسف",latlng:"60.0087030287139 31.8031439071823"},
      {name:"اسدیه",latlng:"60.0265041537785 32.9083252486819"},
      {name:"نهبندان",latlng:"60.0270714381972 31.5383278276754"},
      {name:"سفیدسنگ",latlng:"60.0854739795407 35.6555309561999"},
      {name:"خواف",latlng:"60.1404559050209 34.5729214326015"},
      {name:"نشتیفان",latlng:"60.1750719991741 34.4290900892224"},
      {name:"اسپکه",latlng:"60.1754233333984 26.8392579525699"},
      {name:"بزمان",latlng:"60.1766781882911 27.8584600232228"},
      {name:"طبس مسینا",latlng:"60.2224607288809 32.8099520512563"},
      {name:"گزیک",latlng:"60.2246286484893 33.0033814636615"},
      {name:"نیک شهر",latlng:"60.2298039578271 26.2341064427719"},
      {name:"سنگان",latlng:"60.2549679657413 34.3951801976995"},
      {name:"باخرز",latlng:"60.3139062306448 34.9882457715285"},
      {name:"کنارک",latlng:"60.384832620236 25.4002878952452"},
      {name:"بمپور",latlng:"60.4548254919269 27.1931448264139"},
      {name:"مشهدریزه",latlng:"60.5043141118639 34.7925509652802"},
      {name:"مزدآوند",latlng:"60.5347394496168 36.1570359324832"},
      {name:"محمدان",latlng:"60.5554407573295 27.1997398471856"},
      {name:"تربت جام",latlng:"60.6202240909072 35.2406516997894"},
      {name:"چاه بهار",latlng:"60.645882016838 25.2946711644214"},
      {name:"ایرانشهر",latlng:"60.6820827420654 27.2047410137103"},
      {name:"احمدابادصولت",latlng:"60.6922923521558 35.1150755292027"},
      {name:"قصرقند",latlng:"60.7425640272932 26.2364250004694"},
      {name:"نوک آباد",latlng:"60.7659313598238 28.5409768673154"},
      {name:"نیل شهر",latlng:"60.7692414599677 35.1284067136885"},
      {name:"تایباد",latlng:"60.7782281052157 34.7380044607812"},
      {name:"کاریز",latlng:"60.8238064073141 34.8128637151608"},
      {name:"شهر زاهدان",latlng:"60.8695045738214 29.48931240798"},
      {name:"نگور",latlng:"61.1391913247889 25.3919700854305"},
      {name:"سرخس",latlng:"61.1585140101445 36.5331726982858"},
      {name:"خاش",latlng:"61.2191537711741 28.2194536449249"},
      {name:"سرباز",latlng:"61.2564953764949 26.6283320566305"},
      {name:"علی اکبر",latlng:"61.3320155201956 30.9352400668929"},
      {name:"راسک",latlng:"61.3984677116346 26.2369055226233"},
      {name:"ادیمی",latlng:"61.4160061851321 31.1057308456645"},
      {name:"میرجاوه",latlng:"61.450919929096 29.0181055448768"},
      {name:"زابل",latlng:"61.4956983224906 31.0290800469044"},
      {name:"بنجار",latlng:"61.5678773662846 31.0418895921979"},
      {name:"زابلی",latlng:"61.673169938503 27.132311503394"},
      {name:"زهک",latlng:"61.6801734684116 30.8953635837517"},
      {name:"پیشین",latlng:"61.7556118168847 26.0806445722461"},
      {name:"دوست محمد",latlng:"61.7933341893845 31.1399229291277"},
      {name:"گشت",latlng:"61.9543406302999 27.7884090288582"},
      {name:"سوران",latlng:"61.995732758121 27.2823225727745"},
      {name:"هیدوچ",latlng:"62.1237164890605 27.0013861151608"},
      {name:"سراوان",latlng:"62.3322171678141 27.3685042545656"},
      {name:"محمدی",latlng:"62.3866184484688 27.3247559140148"},
      {name:"سیرکان",latlng:"62.6458707638954 26.8358684024443"},
      {name:"جالق",latlng:"62.7056015121068 27.5994001969328"}
    ],
    areaDetail:{
      midwayServiceAreaTypeName:"",
      name:"",
      side:"",
    },
    searchMapDialog:false,
    overlay:false,
    value: 0,
    isReverse:true,
    latlng:"",
    currlat:"",
    currlng:"",
    lat:"",
    lng:"",
    otherlatlng:"",
    firstlatlng:"",
    secondlatlng:"",
    response:"",
    map:"",
    searchPlace:"NearMe",
    snackbar:false,
    snackText:"",
    snackIcon:"",
    snackColor:"",
  }),
  components: {
    VueSlideBar,
    ServiceAreaDetailsDialog
  },
  mounted() {
    this.searchButtonsClick();
    this.getMidWayServiceAreaTypes();
    this.changeRange();
    this.changeRange1();
    this.setReverse();
    this.getCurrentLocation();
  },
  methods: {
    getCurrentLocation(fromNearMe){
      var th = this;
      if (navigator.geolocation) {
        navigator.geolocation.getCurrentPosition(
            function (position) {
              th.currlat = position.coords.latitude;
              th.currlng = position.coords.longitude;
              if(fromNearMe==="NearMe"){
                th.Layersheet = false
                th.$root.$emit('NearMe', th.myLocValue);
              }
            },
            function (error) {
              th.snackColor = "red accent-2";
              th.snackText = th.$t("SnackBar.TurnOnLocation");
              th.snackIcon = "mdi-close-circle";
              th.snackbar = true;
            },
            {
              enableHighAccuracy: true,
              timeout: 10000,
            }
        );
      } else {
        alert("Geolocation is not supported by this browser.");
      }
    },
    LoadMarkers() {
      var th = this;
      console.log(this.searchPlace)
      if(this.otherlatlng.latlng){
          var otherlatlng = this.otherlatlng.latlng.split(" ");
        }else{
          var otherlatlng = this.otherlatlng.split(" ");
        }
        if(this.firstlatlng.latlng){
          var firstlatlng = this.firstlatlng.latlng.split(" ");
        }else{
          var firstlatlng = this.firstlatlng.split(" ");
        }
        if(this.secondlatlng.latlng){
          var secondlatlng = this.secondlatlng.latlng.split(" ");
        }else{
          var secondlatlng = this.secondlatlng.split(" ");
        }

      if(this.searchPlace==="NearMe"){
        this.getCurrentLocation("NearMe");

      }else if(this.searchPlace==="Near"){
        if(this.otherlatlng===""){
          this.snackColor = "red accent-2";
          this.snackText = this.$t('SearchSheet.EmptyCityError');
          this.snackIcon = "mdi-close-circle"
          this.snackbar = true;
        }else
        if(this.otherlatlng!=""){
          this.Layersheet = false
          this.$root.$emit('Near', otherlatlng,this.otherPlaceValue);
          document.cookie = "radius=" + this.otherPlaceValue;
        }
      }else  if(this.searchPlace==="Between"){
        if(this.firstlatlng === ""){
          this.snackColor = "red accent-2";
          this.snackText = this.$t('SearchSheet.EmptyFirstCityError');
          this.snackIcon = "mdi-close-circle"
          this.snackbar = true;
        }else if(this.secondlatlng === ""){
          this.snackColor = "red accent-2";
          this.snackText = this.$t('SearchSheet.EmptySecondCityError');
          this.snackIcon = "mdi-close-circle"
          this.snackbar = true;
        }else if(this.firstlatlng === "" && this.secondlatlng === ""){
          this.snackColor = "red accent-2";
          this.snackText = this.$t('SearchSheet.EmptyCityError');
          this.snackIcon = "mdi-close-circle"
          this.snackbar = true;
        }
        if(this.firstlatlng != "" && this.secondlatlng != ""){
          this.Layersheet = false
          this.$root.$emit('Between', true);
          this.$root.$emit('firstlatlng', firstlatlng);
          this.$root.$emit('secondlatlng', secondlatlng);
        }
      }

    },
    searchButtonsClick() {
      $("#otherPlaceSearch").fadeOut(50);
      ;
      $("#betweenSearch").fadeOut(50);

      $("#btnMyLocation").on("click", function () {
        $("#otherPlaceSearch").fadeOut(50);
        ;
        $("#betweenSearch").fadeOut(50);
        ;
        $("#myLocationSearch").fadeIn(500);
      });

      $("#btnOtherPlace").on("click", function () {
        $("#myLocationSearch").fadeOut(50);
        $("#betweenSearch").fadeOut(50);
        $("#otherPlaceSearch").fadeIn(500);
        ;
      });

      $("#btnBetween").on("click", function () {
        $("#otherPlaceSearch").fadeOut(50);
        $("#myLocationSearch").fadeOut(50);
        $("#betweenSearch").fadeIn(500);
        ;
      });
    },
    getMidWayServiceAreaTypes() {
      var th = this;
      const formData = new FormData();
      formData.append('locale', "fa_IR");
      formData.append('dateInMiliseconds', "true");
      formData.append('cmd', "{'/MidwayServiceArea-portlet.midwayareatype/get-mid-way-service-area-types-with-documents':{}}");
      axios.post('https://restareas.rmto.ir/api/jsonws/invoke', formData,
      ).then(response => {
        for (let i = 0; i < response.data.length; i++) {
          if (response.data[i].parentMidwayServiceAreaServicesId === response.data[i].midwayServiceAreaTypeId) {
            response.data[i]["select"] = false;
            response.data[i]["color"] = "white";
            this.serviceTypes.push(response.data[i])

          }
        }
        console.log(this.serviceTypes)
        // this.addServiceTypesToDiv();
        $(".type").on('click', function (e) {
          if(e.currentTarget.style.backgroundColor==="rgb(255, 255, 255)" || e.currentTarget.style.backgroundColor==="white"){
            e.currentTarget.style.backgroundColor="rgb(127, 190, 181)";
            th.selectedTypes.push(e.currentTarget.id)
          }else{
            e.currentTarget.style.backgroundColor="rgb(255, 255, 255)"
            for(var j=0;j<th.selectedTypes.length;j++){
              if(th.selectedTypes[j] === e.currentTarget.id){
                th.selectedTypes.splice(j,1);
              }
            }
          }
        });
      })
          .catch(error => {
            this.errorMessage = error.message;
            console.error("There was an error!", error);
          });
    },
    addServiceTypesToDiv() {
      for (var i = 0; i < this.serviceTypes.length; i++) {
        var div = document.createElement("div");
        let label = document.createElement("label");
        let img = document.createElement("img");
        div.style.width = "70px"
        div.style.height = "80px"
        div.style.display = "inline-block"
        div.style.marginTop = "10px"
        div.style.marginRight = "20px"
        div.style.position = "relative"
        div.style.backgroundColor = "white";
        div.id = this.serviceTypes[i].midwayServiceAreaTypeId;
        div.className = "type";
        div.style.borderRadius = "3px";
        label.textContent = this.serviceTypes[i].name;
        label.style.fontFamily = "IranSans";
        label.style.fontSize = "10px";
        label.style.display = "flex";
        label.style.justifyContent = "center";
        label.style.marginTop = "60px";
        label.style.bottom = "0";
        label.style.color = "black";
        label.style.textAlign = "center"
        img.src = "data:application;base64," + this.serviceTypes[i].documents[0].base64File;
        img.style.width = "100px"
        img.style.width = "50px"
        img.style.display = "flex"
        img.style.marginLeft = "10px"
        img.style.position = "absolute"
        img.style.top = "0"
        div.appendChild(label);
        div.appendChild(img);
        document.getElementById("serviceType").appendChild(div);
      }
    },
    updateTextInput(val) {
      $('#textInput').value = val;
    },
    changeRange() {
      var th = this;
      $('#when_change_range').on('change', function () {
        document.getElementById('text_for_show_range').value = $(this).val() + '(km)';
      });
    },
    changeRange1() {
      var th = this;
      $('#when_change_range1').on('change', function () {
        document.getElementById('text_for_show_range1').value = $(this).val() + '(km)';
      });
    },
    setReverse(){
      if(this.$i18n.locale==='en'){
        this.isReverse=false;
      } else if(this.$i18n.locale==='fa'){
        this.isReverse=true;
      }
    },
    getMidwayServiceAreaRatings(id){
      this.ratingArray = [];
      const formData = new FormData();
      formData.append('userId', this.getCookie("phone"));
      formData.append('midwarServiceAreaInfoId', id);
      formData.append('locale', "fa_IR");
      formData.append('cmd', "{'/MidwayServiceArea-portlet.midwayarearating/get-midway-service-area-rating':{}}");
      axios.post('https://restareas.rmto.ir/api/jsonws/invoke', formData,
      ).then(response => {
        response.data.forEach(e=>{
          if(e.midwayServiceAreaInfoId===id){
            this.ratingArray.push(e)
          }
        })
      }).catch(error => {
        this.errorMessage = error.message;
        this.snackColor = "red accent-2";
        this.snackText = this.$t("SnackBar.NetworkError");
        this.snackIcon = "mdi-close-circle";
        this.snackbar = true;
        console.error("There was an error!", error);
      });
    },
    setMapForAddArea(place){
      var th = this;
      mapboxgl.accessToken = 'pk.eyJ1IjoiaGFkaXJlYWw5IiwiYSI6ImNsMmZ0cXNjMjBiY3UzY2xqdzE1OHIxbXEifQ.wi3bA4H8DAxUbGGi0HwQJg';
      var map = new mapboxgl.Map({
        container: 'SelectFromMapDiv',
        style: inStreetStyle,
        center: [53, 32], // starting position
        zoom: 4, // starting zoom,
      });
      // mapboxgl.setRTLTextPlugin('https://api.mapbox.com/mapbox-gl-js/plugins/mapbox-gl-rtl-text/v0.2.3/mapbox-gl-rtl-text.js',null,true);


      map.on('load', function () {
        map.resize();
      });

      map.addControl(
          new mapboxgl.GeolocateControl({
            positionOptions: {enableHighAccuracy: true},
            trackUserLocation: true,
            showUserHeading: true,
          }),
      'bottom-left',
      );
      const marker = new mapboxgl.Marker({
        draggable: true
      })
          .setLngLat([53.6880, 32.4279])
          .addTo(map);
      function onDragEnd() {
        const lngLat = marker.getLngLat();
        th.lng = lngLat.lng;
        th.lat = lngLat.lat;
      }
      marker.on('dragend', onDragEnd);
      marker.getElement().addEventListener('click', () => {
        if(place==='otherplace'){
          th.otherlatlng = th.lng + " " + th.lat
        }else if(place==='firstlatlng'){
          th.firstlatlng = th.lng + " " + th.lat
        }else if(place==='secondlatlng'){
          th.secondlatlng = th.lng + " " + th.lat
        }
        th.SelectFromMapDialog = false;
      });
    },
    setPlaceString(place){
      if(place === 'between'){
        this.searchPlace = "Between"
      }else if(place === 'otherplace'){
        this.searchPlace = "Near"
      }else if(place === 'myLocation'){
        this.searchPlace = "NearMe"
      }

    },
    makeRadius(lngLatArray, radiusInMeters) {
      var point = turf.point(lngLatArray);
      var buffered = turf.buffer(point, radiusInMeters, { units: 'kilometers' });
      return buffered;
    },
    routingClick(coordinates){
      var th = this;
      $('#directions').on('click',function (){
        document.getElementById("MapDiv").innerHTML = "";
        mapboxgl.accessToken = 'pk.eyJ1IjoiaGFkaXJlYWw5IiwiYSI6ImNsMmZ0cXNjMjBiY3UzY2xqdzE1OHIxbXEifQ.wi3bA4H8DAxUbGGi0HwQJg';
        var map = new mapboxgl.Map({
          container: 'MapDiv',
          style: 'mapbox://styles/mapbox/streets-v11',
          center: [53.6880,32.4279], // starting position
          zoom: 4, // starting zoom,
        });
        const start = [53,32];
        async function getRoute(end) {
          const query = await fetch(`https://api.mapbox.com/directions/v5/mapbox/cycling/${start[0]},${start[1]};${end[0]},${end[1]}?steps=true&geometries=geojson&access_token=${mapboxgl.accessToken}`, { method: 'GET' });
          const json = await query.json();
          const data = json.routes[0];
          const route = data.geometry.coordinates;
          const geojson = {
            type: 'Feature',
            properties: {},
            geometry: {
              type: 'LineString',
              coordinates: route
            }
          };
          // if the route already exists on the map, we'll reset it using setData
          if (map.getSource('route')) {
            map.getSource('route').setData(geojson);
          }
          else {
            map.addLayer({
              id: 'route',
              type: 'line',
              source: {
                type: 'geojson',
                data: geojson
              },
              layout: {
                'line-join': 'round',
                'line-cap': 'round'
              },
              paint: {
                'line-color': '#3887be',
                'line-width': 5,
                'line-opacity': 0.75
              }
            });
          }
        }
        // var directions = new MapboxDirections({
        //   accessToken: 'pk.eyJ1IjoiaGFkaXJlYWw5IiwiYSI6ImNsMmZ0cXNjMjBiY3UzY2xqdzE1OHIxbXEifQ.wi3bA4H8DAxUbGGi0HwQJg',
        //   unit: 'metric',
        //   profile: 'mapbox/cycling',
        //   interactive: false
        // });
        // map.addControl(directions, 'top-left')
        const marker1 = new mapboxgl.Marker({ color: 'black', rotation: 45,offset: [0, -50/2] })
            .setLngLat(coordinates)
            .addTo(map);
        map.on('load', function () {
          map.resize();
          getRoute(coordinates);
        });
        map.addControl(
            new mapboxgl.GeolocateControl({
              positionOptions: {
                enableHighAccuracy: true
              },
              trackUserLocation: true,
              showUserHeading: true
            })
        );
        th.routingMap = map;
        th.RoutingDialog=!th.RoutingDialog;
        th.RoutingDialog=true;
        th.ServiceAreaDetailsDialog=false;
      })
    },
    getCookie(name) {
      let cookie = {};
      document.cookie.split(';').forEach(function(el) {
        let [k] = el.split('=');
        cookie[k.trim()] = el.substring(k.length + 1);
      })
      return cookie[name];
    },
    getPersonWithPicture(){
      if(this.getCookie("phone")!='undefined' && this.getCookie("phone") != undefined) {
        const formData = new FormData();
        formData.append('mobileNumber', this.getCookie("phone"));
        formData.append('cmd', "{'/MidwayServiceArea-portlet.person/get-person-with-picture':{}}");
        axios.post('https://restareas.rmto.ir/api/jsonws/invoke', formData,
        ).then(response => {
          this.favoriteAreas = response.data[0].interestedAreas.split(",");
        }).catch(error => {
          this.errorMessage = error.message;
          this.snackColor = "red accent-2";
          this.snackText = this.$t("SnackBar.NetworkError");
          this.snackIcon = "mdi-close-circle";
          this.snackbar = true;
          console.error("There was an error!", error);
        });
      }
    },
    changeTypeDivColor(id){
      for(var i in this.serviceTypes){
        if(this.serviceTypes[i].midwayServiceAreaTypeId===id && this.serviceTypes[i].select===false){
          this.serviceTypes[i].select = true;
          this.serviceTypes[i].color = "#2ec4b4";
        }else if(this.serviceTypes[i].midwayServiceAreaTypeId===id && this.serviceTypes[i].select===true){
          this.serviceTypes[i].select = false;
          this.serviceTypes[i].color = "white";
        }
      }

    }
  }
}

</script>

<style scoped>
.btn{
  margin: 10px;
  direction: rtl;
  width: 25%;
  font-size: 12px !important;
  color: #7fbeb5 !important;
  font-family: IranSans;
}
#myLocationSearch{
  width: 100%;
  height: 100px;
  margin-top: 100px !important;
  position: fixed;
  background-color: #ffffff;
}
#otherPlaceSearch{
  width: 100%;
  height: 150px;
  margin-top: 100px !important;
  position: fixed;
}
#betweenSearch{
  width: 100%;
  height: 150px;
  margin-top: 100px !important;
  position: fixed;
  font-family: IranSans;
}
#when_change_range{
  width: 45%;
  position: relative;
  float: left;
  top: 35px;
  margin-left: 30px;
}
#text_for_show_range{
  margin-left: 50px;
  margin-top: 20px;
}
#when_change_range1{
  width: 50%;
  position: absolute;
  top: 90px;
  display: flex;
  left: 40px;
}
#text_for_show_range1{
  margin-left: -120px;
  top: 120px;
  position: relative;
}
.mapboxgl-ctrl-group {
  border-radius: 50%;
  height: 50px;
  width: 50px;
  margin-right: 330px !important;
  margin-top: 500px !important;
  position: relative;
}
.mapboxgl-ctrl-group button{
  height: 50px;
  width: 50px;
  box-shadow: 0px 3px 1px -2px rgba(0, 0, 0, 0.15), 0px 2px 2px 0px rgba(0, 0, 0, 0.01), 0px 1px 5px 0px rgba(0, 0, 0, 0.12);
}
.mapboxgl-ctrl-group:not(:empty){
  box-shadow: unset !important;
}
.v-sheet.v-card:not(.v-sheet--outlined){
  box-shadow: unset !important;
}
.v-card--link:focus {
  background: blue;
}

.v-card--link:focus::before {
  opacity: 0;
}

</style>
